{"tasks":[{"id":"1","text":"На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о дорогах между населенными пунктами (звездочка означает, что дорога между соответствующими городами есть).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите номера населенных пунктов A и G в таблице. В ответе запишите числа в порядке возрастания без разделителей.","answer":"35","description":"Сопоставим населённые пункты графа и населённые пункты в таблице. Нам необходимо определить номера населенных пунктов A и G. Из В ведут пять дорог. Таким образом, В — 4. Проверим первый пункт: из первого пункта есть дорога во второй, а из второго есть путь в три пункта. Получается, что D — 2. Следовательно, 1, 2 и 6 номера не подходят. Остаются два населенных пункта 3 и 5. Это и есть ответ. Записываем ответ в порядке возрастания без разделителей.\n"},{"id":"2","text":"На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова длина дороги из пункта В в пункт Е. В ответе запишите целое число – так, как оно указано в таблице.","answer":"20","description":"Пункт В − единственный пункт с пятью дорогами, значит, ему соответствует П6, а пункт Е − единственный с четырьмя дорогами, значит, ему соответствует П4. Длина дороги из П6 в П4 равна 20.\n"},{"id":"3","text":"Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых приведена в таблице. (Отсутствие числа в таблице означает, что прямой дороги между пунктами нет.)\nОпределите длину кратчайшего пути между пунктами A и F (при условии, что передвигаться можно только по построенным дорогам).","answer":"14","description":"Варианты маршрутов:\nA-B-C-E-F. Длина маршрута 4 + 6 + 4 + 5 = 19\nA-B-D-E-F. Длина маршрута 4 + 3 + 2 + 5 = 14\nA-B-E-F. Длина маршрута 4 + 6 + 5 = 15\nВидно, что кратчайший путь равен 14.\n"},{"id":"4","text":"На рисунке слева изображена схема дорог Н-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Каждому населённому пункту на схеме соответствует его номер в таблице, но неизвестно, какой именно номер. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам A и G на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.","answer":"67","description":"Сопоставим населённые пункты графа и населённые пункты в таблице. Необходимо определить номера населенных пунктов A и G. Из F ведут шесть дорог. Таким образом, F — 3. Заметим, что из пунктов A и G нет дороги в населённые пункты C и E, из которых идут 2 дороги. Следовательно, пункты 6 и 7 это либо A, либо G.\n"},{"id":"5","text":"На рисунке схема дорог изображена в виде графа, в таблице звёздочкой обозначено наличие дороги между населёнными пунктами. Отсутствие звёздочки означает, что такой дороги нет. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какие номера населённых пунктов соответствуют населённым пунктам Б и В. В ответе запишите эти два номера в порядке возрастания без пробелов и знаков препинания.\nПример. Пусть населённым пунктам Д и Е соответствуют номера П1 и П2. Тогда в ответе нужно написать 12.","answer":"26","description":"Заметим, что Е — единственная вершина степени 2, которая связана с вершинами третьей степени Д и К, связаными с остальными вершинами степени 2. Значит, Е соответствует П5. Далее рассмотрим два варианта:\n1. Пусть Д соответствует П4, а К соответствует П7. В — единственная вершина степени 3, в которую есть дорога из Д, следовательно, В соответствует П2. Б — единственная вершина степени 3, в которую есть дорога из К, следовательно, Б соответствует П6.\n2. Пусть Д соответствует П7, а К соответствует П4. В — единственная вершина степени 3, в которую есть дорога из Д, следовательно, В соответствует П6. Б — единственная вершина степени 3, в которую есть дорога из К, следовательно, Б соответствует П2.\nТаким образом, населённым пунктам Б и В соответствуют П2 и П6.\n"},{"id":"6","text":"На рисунке слева изображена схема дорог Н-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Каждому населённому пункту на схеме соответствует его номер в таблице, но неизвестно, какой именно номер. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам B и C на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.","answer":"26","description":"Заметим, что D - единственная вершина степени 2, которая связана с вершинами степени 3 — B и C, связаными с остальными вершинами степени 2. Значит, D соответствует П4. Таким образом, населённым пунктам B и C соответствуют пункты П2 и П6.\n"},{"id":"7","text":"На рисунке слева изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Каждому населённому пункту на схеме соответствует его номер в таблице, но неизвестно, какой именно номер. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам E и G на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.","answer":"45","description":"Заметим, что A — единственная вершина степени 4. Значит, A соответствует номер 2. C и F — вершины степени 2, следовательно, им соответствуют номера 1 и 3. Пункты D и B единственные вершины степени 3, соединённые с пунктами C и F, значит, D и B соответствуют номера 6 и 7. Таким образом, вершинам E и G соответствуют номера 4 и 5. Значит, ответ — 45.\n"},{"id":"8","text":"На рисунке слева изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Каждому населённому пункту на схеме соответствует его номер в таблице, но неизвестно, какой именно номер. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам E и F на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.","answer":"46","description":"Заметим, что B — единственная вершина степени 4. Значит, B соответствует номер 1. G и D — вершины степени 2, следовательно, им соответствуют номера 2 и 7. Пункты A и C единственные вершины степени 3, соединённые с пунктами G и D, значит, A и C соответствуют номера 3 и 5. Таким образом, вершинам E и F соответствуют номера 4 и 6. Значит, ответ — 46.\n"},{"id":"9","text":"На рисунке слева изображена схема дорог Н-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам В и Е на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.","answer":"26","description":"Заметим, что вершины А и Д — единственные вершины степени 3, из которых идут дороги в две вершины степени 2. Значит, вершинам А и Д соответствуют пункты 4 и 7. Значит, вершинам В и Е соответствуют пункты 2 и 6.\n"},{"id":"10","text":"На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Известно, что длина дороги АГ больше, чем длина дороги ВГ. Определите длину дороги БЖ. В ответе запишите целое число — длину дороги в километрах.","answer":"19","description":"Заметим, что Д — единственная вершина степени 4. Значит, Д соответствует П3. Заметим, что вершины А и В — единственные вершины степени 3, не связанные с вершиной Д. Значит, вершины А и В соответствуют П4 и П5. Вершина Г — единственная вершина степени 3, связанная и с вершинами А и В, и с вершиной Д. Значит, Г соответствует П1. По условию длина дороги АГ больше, чем длина дороги ВГ, значит, вершине А соответствует П5, и вершине В соответствует П4. Вершина Е — единственная вершина степени 3, кроме вершины Г, связанная с вершинами В и Д. Значит, Е соответствует П6. Значит, вершине Ж соответствует П2, а вершине Б соответствует П7. Найдём длину дороги БЖ по таблице, она равна 19.\n"},{"id":"11","text":"На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Известно, что длина дороги АГ меньше, чем длина дороги ВГ. Определите длину дороги ЕЖ. В ответе запишите целое число — длину дороги в километрах.","answer":"24","description":"Заметим, что Д — единственная вершина степени 4. Значит, Д соответствует П4. Заметим, что вершины А и В — единственные вершины степени 3, не связанные с вершиной Д. Значит, вершины А и В соответствуют П3 и П7. Вершина Г — единственная вершина степени 3, связанная и с вершинами А и В, и с вершиной Д. Значит, Г соответствует П6. По условию длина дороги АГ меньше, чем длина дороги ВГ, значит, вершине А соответствует П7 и вершине В соответствует П3. Вершина Е — единственная вершина степени 3, кроме вершины Г, связанная с вершинами В и Д. Значит, Е соответствует П1. Значит, вершинам Б и Ж соответствуют П2 и П5. Из пункта Е (П1) нет дороги в П2 и есть дорога в П5, значит, Ж — это П5. Найдём длину дороги ЕЖ (П1—П5) по таблице, она равна 24.\n"},{"id":"12","text":"На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта Б в пункт Д и из пункта В в пункт Е. В ответе запишите целое число.","answer":"22","description":"Заметим, что А — единственная вершина степени 2, значит, А соответствует П4. Вершины Б и В единственные вершины степени 3, связанные с вершиной А. Следовательно, вершинам Б и В могут соответствовать П3 и П6. Вершины Б и В связаны с вершинами Д и Е степени 3. Значит, Д и Е могут соответствовать П2 и П1. Расстояние из П3 в П2 равно 14, расстояние из П6 в П1 равно 8. Значит, сумма протяжённостей дорог из пункта Б в пункт Д и из пункта В в пункт Е равно 14 + 8 = 22.\n"},{"id":"13","text":"На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта Б в пункт В и из пункта Г в пункт Д. В ответе запишите целое число.","answer":"20","description":"Заметим, что К — единственная вершина шестой степени, значит, К соответствует П5. Вершины А и Е — единственные вершины степени 2, тогда они могут соответствовать П1 и П3. Вершины Б и Д связаны с вершинами А и Е, тогда из таблицы получаем, что они могут соответствовать П2 и П4. Тогда В и Г могут соответствовать П6 и П7.Заметим, что точное соответствие букв пунктам не важно. Таким образом, сумма протяжённостей дорог из пункта Б в пункт В и из пункта Г в пункт Д равна 13 + 7 = 20.\n"},{"id":"14","text":"На рисунке слева изображена схема дорог Н-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам Б и В на схеме. В ответ запишите без разделителей сначала номер пункта Б, потом номер пункта В.","answer":"14","description":"Заметим, что пункты К и Ж имеют степень 2. Значит, им соответствуют номера 2 и 7. Пункт Д — единственная вершина степени 3, из которой идут дороги и в пункт К, и в пункт Ж. Значит, пункту Д соответствует номер 3. Из пункта Д также идёт дорога в пункт В. Следовательно, пункту В соответствует номер 4. Пункт Е — единственная вершина степени 3, которая соединена дорогами и с пунктом К, и с пунктом В. Значит, пункту Е соответствует номер 6. Из пункта Е также идёт дорога в пункт Б. Следовательно, пункту Б соответствует номер 1. Таким образом, получаем ответ — 14.\n"},{"id":"15","text":"На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину более длинной из дорог ГЖ и ЕИ. В ответе запишите целое число — длину дороги в километрах.","answer":"8","description":"Заметим, что вершина единственная вершина степени 7 — вершина Д, следовательно, Д соответствует П5. Вершина Б — единственная вершина степени 3, соединённая с двумя вершинами степени 2. Следовательно, Б соответствует П8. Тогда вершины А и В могут соответствовать П3 и П7.\n\nТаким образом, вершины Г и Е могут соответствовать П4 и П6, а вершины Ж и И могут соответствовать П1 и П2. Точное совпадение в данном случае не требуется. Длины дорог ГЖ и ЕИ равны 8 и 7. Следовательно, ответ — 8.\n"},{"id":"16","text":"На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова длина дороги из пункта Г в пункт Е. В ответе запишите целое число – так, как оно указано в таблице.","answer":"40","description":"Пункт Г − единственный пункт с тремя дорогами, значит, ему соответствует П2, а пункт Е − единственный с четырьмя дорогами, значит, ему соответствует П4. Длина дороги из П2 в П4 равна 40.\n"},{"id":"17","text":"На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова длина дороги из пункта В в пункт Г. В ответе запишите целое число – так, как оно указано в таблице.","answer":"55","description":"Пункт В − единственный пункт с пятью дорогами, значит, ему соответствует П6, а пункт Г − единственный с тремя дорогами, значит, ему соответствует П2. Длина дороги из П6 в П2 равна 55.\n"},{"id":"18","text":"На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги из пункта А в пункт Г. В ответе запишите целое число.","answer":"22","description":"На карте есть только один пункт с 5 дорогами, это Г. В таблице же это П2.\nНа карте есть только один пункт с 2 дорогами, это Б. В таблице же это П5.\nА - пункт, из которого выходит 3 дороги, который связан и с Г, и с Б. Из всех пунктов в таблице только П3 под это подходит.\nТаким образом, Г = П2, А = П3. Длина дороги между П2 и П3 - 22.\n"},{"id":"19","text":"На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги из пункта Б в пункт Г. В ответе запишите целое число.\n","answer":"15","description":"Сопоставим населённые пункты графа и населённые пункты в таблице.\nИз Б ведут три дороги. Из пунктов П1, П3, П5, П6 также ведут три дороги. Заметим, что из Б дороги идут в пункты с тремя, четырьмя и тремя дорогами. Сопоставляя с таблицей, получим, что Б соответствует пункту П6.\nИз Г ведут четыре дороги. Только из пункта П8 ведут четыре дороги, следовательно, пункт П8 — это и есть Г.\nДлина дороги из П6 в П8 равна 15.\n"},{"id":"20","text":"На рисунке схема дорог изображена в виде графа, в таблице звёздочками обозначено наличие дороги между населёнными пунктами. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Укажите номера, которые могут соответствовать пунктам Г и Д. В ответе запишите эти номера в порядке возрастания без пробелов и знаков препинания.","answer":"37","description":"Вершина Б — единственная вершина степени 2, из которой идут дороги только к вершинам степени 3 — это А и В. Значит, Б соответствует П1, А и В — П5 и П6.\nВершина Ж и И — единственные вершины степени 2, из которых идут дороги к вершинам степени 2 и к вершинам степени 3. Значит, И и Ж соответствуют П4 и П9, а Е и К — П2 и П8.\nСледовательно, Г и Д  соответствуют П3 и П7."}]}