{'tasks': [{'id': '1', 'text': 'Текстовый файл состоит не более чем из 10^6 символов X, Y и Z. Определите максимальное количество идущих подряд символов, среди которых каждые два соседних различны.\nДля выполнения этого задания следует написать программу. Ниже приведён файл, который необходимо обработать с помощью данного алгоритма.', 'answer': '35', 'description': 'Решение задачи на языке Python.', 'python': '...когда-то здесь будет решение этой задачи на питончике.\n'}, {'id': '2', 'text': 'Текстовый файл состоит не более чем из 10^6 символов X, Y и Z. Определите длину самой длинной последовательности, состоящей из символов X. Хотя бы один символ X находится в последовательности.\nДля выполнения этого задания следует написать программу. Ниже приведён файл, который необходимо обработать с помощью данного алгоритма.', 'answer': '19', 'description': 'Решение задачи на языке Python.', 'python': "f=open('24_demo.txt')\ns=f.readline()\nmx=1\ncnt=1\nfor i in range(len(s)-1):\n    if s[i]=='X' and s[i+1]=='X':\n        cnt+=1\n        if cnt>mx:\n            mx=cnt\n    else:\n        cnt=1\nmx = max(cnt, mx)\nprint(mx)\n"}, {'id': '3', 'text': 'Текстовый файл состоит не более чем из 10^6 символов X, Y и Z. Определите длину самой длинной последовательности, состоящей из символов Y. Хотя бы один символ Y находится в последовательности.\nДля выполнения этого задания следует написать программу. Ниже приведён файл, который необходимо обработать с помощью данного алгоритма.', 'answer': '10', 'description': 'Решение задачи на языке Python.', 'python': "f = open('24.txt').readline()\nk = 1\nm = 0\nfor i in range(len(f)-1):\n    if f[i] == 'Y' and f[i+1] == 'Y':\n        k += 1\n        m = max(m, k)\n    else: k = 1\nprint(m)"}]}
