{"tasks":[{"id":"1","text":"Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев.\nСколько раз встречалась температура, которая была ниже половины от максимального значения?","answer":"601","description":"Для поиска максимального значения температуры воспользуемся формулой =МАКС(B2:Y92). Максимальное значение температуры равно 39,0. Теперь с помощью формулы =СЧЁТЕСЛИ(B2:Y92;\"<19,5\") найдём количество измерений, которые ниже половины максимального значения  — 601.\n"},{"id":"2","text":"В каждой строке электронной таблицы записаны три натуральных числа, задающих длины трёх взаимно перпендикулярных рёбер прямоугольного параллелепипеда. Определите, сколько в таблице троек, для которых у заданного ими параллелепипеда для любых трёх граней с общей вершиной сумма площадей двух из них больше площади третьей.","answer":"1878","description":"Для нахождения количества параллелепипедов, удовлетворяющих условию, необходимо найти площадь наибольшей грани и сумма площадей двух других граней. То есть для каждой тройки чисел необходимо найти произведение двух наибольших чисел, а также сумму произведений наибольшего и наименьшего чисел и среднего по величине и наименьшего чисел. В ячейку D1 запишем формулу\n\n=МАКС(A1:C1)*(СУММ(A1:C1)-МАКС(A1:C1)-МИН(A1:C1))\n\nи скопируем её во все ячейки диапазона D2:D5000. Таким образом, для каждой тройки чисел найдём произведение двух наибольших чисел. В ячейку E1 запишем формулу\n\n=МАКС(A1:C1)*МИН(A1:C1)+(СУММ(A1:C1)-МАКС(A1:C1)-МИН(A1:C1))*МИН(A1:C1)\n\nи скопируем её во все ячейки диапазона E2:E5000. Таким образом, для каждой тройки чисел найдём сумму произведений наибольшего и наименьшего чисел и среднего по величине и наименьшего чисел. Теперь в ячейке F1 запишем формулу =ЕСЛИ(D1 < E1;1;0) и скопируем её во все ячейки диапазона F2:F5000. Окончательно, с помощью формулы =СУММ(F1:F5000) получим ответ  — 1878.\n\n \n"},{"id":"3","text":"Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа.\nВыясните, какое количество троек чисел может являться сторонами треугольника, то есть удовлетворяет неравенству треугольника. В ответе запишите только число.","answer":"2453","description":"Неравенство треугольника будет заведомо выполнено для всех сторон треугольника, если длина наибольшей стороны треугольника будет меньше суммы длин других двух сторон. В ячейке D1 запишем формулу =МАКС(A1:C1) и скопируем её во все ячейки диапазона D2:D5000. В ячейке E1 запишем формулу =СУММ(A1:C1)-МАКС(A1:C1) и скопируем её во все ячейки диапазона E2:E5000. Таким образом, получим длину наибольшей стороны и сумму других двух сторон для каждой тройки чисел. После этого в ячейку F1 запишем формулу =ЕСЛИ(D1<E1;1;0) и скопируем её во все ячейки диапазона F2:F5000. Теперь, воспользовавшись формулой =СУММ(F1:F5000), получим ответ: 2453.\n"},{"id":"4","text":"Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев.\nСколько раз встречалась температура, ниже округленного до десятых среднего арифметического значения всех чисел в таблице?","answer":"992","description":"Для поиска среднего арифметического значения температуры воспользуемся формулой =СРЗНАЧ(B2:Y92). Среднее арифметическое значение температуры равно 23,9. Теперь с помощью формулы =СЧЁТЕСЛИ(B2:Y92; \"<23,9\") найдём количество измерений, которые ниже среднего арифметического значения  — 992.\n"},{"id":"5","text":"Электронная таблица содержит результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев. Определите, сколько раз за время измерений максимальная суточная температура оказывалась выше среднесуточной на 7 и более градусов.\n\nЗадание 9","answer":"66","description":"Найдём разницу между максимальной суточной температурой и среднесуточной температурой для каждого дня в таблице. Для этого в ячейке Z2 запишем формулу =МАКС(B2:Y2)-СРЗНАЧ(B2:Y2) и скопируем её во все ячейки диапазона Z3:Z92. Далее, в ячейке Z1 запишем формулу =СЧЁТЕСЛИ(Z2:Z92;\">=7\") и получим ответ  — 66.\n"},{"id":"6","text":"Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев.\nСколько раз встречалась температура, которая была выше половины среднего арифметического значения, округленного до десятых, но ниже половины от максимального значения?","answer":"526","description":"Для поиска среднего арифметического значения температуры воспользуемся формулой =СРЗНАЧ(B2:Y92). Среднее арифметическое значение температуры равно 23,9. Для поиска максимального значения воспользуемся формулой =МАКС(B2:Y92). Максимальное значение температуры равно 39,0. Теперь с помощью формулы =СЧЁТЕСЛИМН(B2:Y92; \">11,95\"; B2:Y92;\"<19,5\") найдём количество измерений, которые выше половины среднего арифметического значения, но ниже половины от максимального значения  — 526.\n"},{"id":"7","text":"Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев.\nНайдите количество значений, которые выше округленного до десятых среднего значения всех чисел таблицы, но меньше 30 °C.","answer":"633","description":"С помощью формулы =СРЗНАЧ(B2:Y92) найдём среднее арифметическое значение всех измерений  — 23,3. Теперь с помощью формулы =СЧЁТЕСЛИМН(B2:Y92; \">23,3\"; B2:Y92;\"<30\") найдём количество измерений, которые выше среднего арифметического значения, но ниже 30 °С  — 633.\n"},{"id":"8","text":"В каждой строке электронной таблицы записаны четыре натуральных числа. Определите, сколько в таблице таких четвёрок, в которых любые три числа могут быть сторонами невырожденного треугольника (вырожденным называется треугольник, у которого сумма длин двух сторон равна длине третьей стороны).","answer":"1842","description":"Заметим, что если наибольшее число больше или равно сумме двух наименьших, то из этих трех чисел треугольник составить нельзя, а потому и вся четверка чисел не подходит. Если же наибольшее число меньше суммы двух наименьших, то из любых трех чисел такой четверки треугольник составить можно. Найдем все такие четверки чисел.\n\nВ ячейку E1 запишем формулу =МАКС(A1:D1) и скопируем её во все ячейки диапазона E2:E5000. В ячейку F1 запишем формулу =МИН(A1:D1) и скопируем её во все ячейки диапазона F2:F5000. В ячейку G1 запишем формулу =НАИМЕНЬШИЙ(A1:D1;2) и скопируем её во все ячейки диапазона G2:G5000. Таким образом, найдём наибольшее число и два наименьших числа в строке. В ячейку H1 запишем формулу =ЕСЛИ(E1<F1+G1;1;0) и скопируем её во все ячейки диапазона H2:H5000. Окончательно, с помощью формулы =СУММ(H1:H5000) получим ответ  — 1842.\n"},{"id":"9","text":"Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев.\nСколько раз встречалась температура, которая равна минимальному значению?","answer":"1","description":"Для поиска минимального значения температуры воспользуемся формулой =МИН(B2:Y92). Минимальное значение температуры равно 8,1. Для счета количества значений 8,1 воспользуемся формулой =СЧЁТЕСЛИ(B2:Y92; \"8,1\"). Такое значение встречается 1 раз.\n"},{"id":"10","text":"Электронная таблица содержит результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев. Определите, сколько раз за время наблюдений температура в 8:00 была выше среднесуточной температуры того же дня.\n\nЗадание 9","answer":"30","description":"Для поиска суточных колебаний температуры воспользуемся формулой =ЕСЛИ(СРЗНАЧ(B2:Y2)<J2;1;\"\") в ячейке Z2. Скопируем эту формулу во все ячейки диапазона Z3:Z92. Теперь в ячейке Z93 с помощью формулы =СУММ(Z2:Z92) найдём, сколько раз за время наблюдений температура в 8:00 была выше среднесуточной температуры того же дня. Ответ  — 30.\n"},{"id":"11","text":"Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев.\nСколько раз встречалась температура, равная округленному до десятых среднему арифметическому значению всех измерений в таблице?","answer":"0","description":"С помощью формулы =СРЗНАЧ(B2:Y92) найдём среднее арифметическое значение всех измерений  — 23,9. Для счета количества значений 23,9 воспользуемся формулой =СЧЁТЕСЛИ(B2:Y92; \"23,9\"). Такое значение встречается 0 раз.\n"},{"id":"12","text":"Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев.\nСколько раз встречалась температура, которая была выше удвоенного минимального значения?","answer":"1832","description":"Для поиска минимального значения температуры воспользуемся формулой =МИН(B2:Y92). Минимальное значение температуры равно 8,1. Теперь с помощью формулы =СЧЁТЕСЛИ(B2:Y92;\">16,2\") найдём количество измерений, которые превышали удвоенное минимальное значение  — 1832.\n"},{"id":"13","text":"Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев.\nНайдите количество суток, в которых среднее значение температуры не превышало 20 °С.","answer":"30","description":"С помощью формулы =СРЗНАЧ(B2:Y2) найдём среднее арифметическое значение температуры для первых суток  — 18,3. Далее с помощью маркера скопируем формулы в ячейки Z3:Z92. Теперь с помощью формулы =СЧЁТЕСЛИ(Z2:Z92;\"<=20\") найдём количество суток, в которых среднее значение температуры не превышало 20 °С  — 30.\n"},{"id":"14","text":"Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев.\nНайдите разность между максимальным значением температуры за три месяца и её средним арифметическим значением. В ответе запишите только целую часть получившегося числа.","answer":"14","description":"Для поиска максимального значения температуры воспользуемся формулой =МАКС(B2:Y92) в ячейке Z2. Максимальное значения температуры равно 38,0. Теперь в ячейке Z3 с помощью формулы =СРЗНАЧ(B2:Y92) найдём среднее арифметическое значение всех измерений  — 23,3. Теперь найдём разность в ячейке Z4 с помощью формулы =Z2–Z3: 38,0 − 23,3  =  14,7. Тогда ответ  — 14.\n"},{"id":"15","text":"Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха в течение трёх месяцев. Найдите разность между максимальной температурой воздуха с 1 апреля по 31 мая с 9:00 до 12:00 включительно и средним значением температуры воздуха в эти часы в апреле и мае, используя данные, представленные в таблице.\nВ ответе запишите только целую часть получившегося числа.","answer":"5","description":"Для поиска максимальной температуры воздуха в с 1 апреля по 31 мая с 9:00 до 12:00 включительно в ячейке Z2 запишем формулу =МАКС(K2:N62). Далее, в ячейке AA2 запишем формулу =СРЗНАЧ(K2:N62). В ячейку Z3 запишем формулу =Z2-AA2, получаем в этой ячейке значение 5,7. Значит, ответ  — 5.\n"},{"id":"16","text":"Электронная таблица содержит результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев. Определите, сколько раз за время наблюдений суточные колебания температуры (разность между максимальной и минимальной температурой в течение суток) превышали 17 градусов.","answer":"12","description":"Для поиска суточных колебаний температуры воспользуемся формулой =МАКС(B2:Y2)-МИН(B2:Y2) в ячейке Z2. Скопируем эту формулу во все ячейки диапазона Z3:Z92. Теперь в ячейке Z93 с помощью формулы =СЧЁТЕСЛИ(Z2:Z92;\">17\") найдём, сколько раз за время наблюдений суточные колебания температуры (разность между максимальной и минимальной температурой в течение суток) превышали 17 градусов. Ответ  — 12.\n"},{"id":"17","text":"Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа.\nОпределите, сколько среди заданных троек чисел таких, которые могут быть сторонами прямоугольного треугольника.","answer":"2","description":"Заметим, что треугольник является прямоугольным, если квадрат длины гипотенузы треугольника будет равен сумме квадратов длин катетов этого треугольника. Тогда в ячейке D1 запишем формулу =(МАКС(A1:C1))^2 и скопируем её во все ячейки диапазона D2:D5000. В ячейке E1 запишем формулу\n\n=(МИН(A1:C1))^2+(СУММ(A1:C1)-МИН(A1:C1)-МАКС(A1:C1))^2\n\nи скопируем её во все ячейки диапазона E2:E5000. Таким образом, получим квадрат длины гипотенузы и сумму квадратов катетов для каждой тройки чисел. После этого в ячейку F1 запишем формулу =ЕСЛИ(D1=E1;1;0) и скопируем её во все ячейки диапазона F2:F5000. Теперь, воспользовавшись формулой =СУММ(F1:F5000), получим ответ  — 2.\n"},{"id":"18","text":"Электронная таблица содержит результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев. Определите, сколько раз за время измерений минимальная суточная температура оказывалась ниже среднесуточной на 8 и более градусов.","answer":"51","description":"Найдём разницу между минимальной суточной температурой и среднесуточной температурой для каждого дня в таблице. Для этого в ячейке Z2 запишем формулу =СРЗНАЧ(B2:Y2)-МИН(B2:Y2) и скопируем её во все ячейки диапазона Z3:Z92. Далее, в ячейке Z1 запишем формулу =СЧЁТЕСЛИ(Z2:Z92;\">=8\") и получим ответ  — 51.\n"},{"id":"19","text":"Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа.\nОпределите сколько среди заданных троек чисел таких, которые могут быть сторонами остроугольного треугольника.","answer":"1074","description":"Заметим, что треугольник является остроугольным, если квадрат длины наибольшей стороны треугольника будет меньше суммы квадратов длин других двух сторон. Тогда в ячейке D1 запишем формулу =(МАКС(A1:C1))^2 и скопируем её во все ячейки диапазона D2:D5000. В ячейке E1 запишем формулу\n\n=(МИН(A1:C1))^2+(СУММ(A1:C1)-МИН(A1:C1)-МАКС(A1:C1))^2\n\nи скопируем её во все ячейки диапазона E2:E5000. Таким образом, получим квадрат длины наибольшей стороны и сумму квадратов других двух сторон для каждой тройки чисел. После этого в ячейку F1 запишем формулу =ЕСЛИ(D1<E1;1;0) и скопируем её во все ячейки диапазона F2:F5000. Теперь, воспользовавшись формулой =СУММ(F1:F5000) получим ответ  — 1074.\n"},{"id":"20","text":"Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел.\nОпределите количество строк таблицы, в которых квадрат суммы максимального и минимального чисел в строке больше суммы квадратов трёх оставшихся.","answer":"2640","description":"Для каждой строки найдём квадрат суммы максимального и минимального чисел в строке и сумму квадратов трёх оставшихся. В ячейке F1 запишем формулу =(МАКС(A1:E1)+МИН(A1:E1))^2 и скопируем её во все ячейки диапазона F2:F3200. В ячейке G1 запишем формулу =СУММКВ(A1:E1)-МАКС(A1:E1)^2-МИН(A1:E1)^2 и скопируем её во все ячейки диапазона G2:G3200.\n\nЕсли число в ячейке столбца F больше соседнего числа в ячейке столбца G, будем учитывать эту строку. В ячейке H1 запишем формулу =ЕСЛИ(F1>G1;1;0) и скопируем её во все ячейки диапазона H2:H3200. Таким образом, с помощью формулы =СУММ(H1:H3200), получим ответ  — 2640."}]}