{"tasks": [{"id": "1", "text": "Игорь составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Игорь использует 5-буквенные слова, в которых есть только буквы П, И, Р, причём буква П появляется ровно 1 раз. Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем. Сколько различных кодовых слов может использовать Игорь?", "answer": "80", "description": "Решение задачи на языке Python.", "python": "import itertools\ncounter = 0\nfor elem in itertools.product('ПИР', repeat=5):\n    word = ''.join(elem)\n    if word.count('П') == 1:\n        counter += 1\nprint(counter)\n"}, {"id": "2", "text": "Сколько слов длины 5, начинающихся с гласной буквы, можно составить из букв Е, Г, Э? Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка.", "answer": "162", "description": "Решение задачи на языке Python.", "python": "import itertools\ncounter = 0\nfor elem in itertools.product('ЕГЭ', repeat=5):\n    word = ''.join(elem)\n    if word[0] in ['Е', 'Э']:\n        counter += 1\nprint(counter)\n"}, {"id": "3", "text": "Сколько существует различных символьных последовательностей длины 5 в четырёхбуквенном алфавите {A, C, G, T}, которые содержат ровно две буквы A?", "answer": "270", "description": "Решение задачи на языке Python.", "python": "import itertools\ncounter = 0\nfor elem in itertools.product('ACGT', repeat=5):\n    word = ''.join(elem)\n    if word.count('A') == 2:\n        counter += 1\nprint(counter)\n"}, {"id": "4", "text": "Сколько слов длины 4, начинающихся с согласной буквы и заканчивающихся гласной буквой, можно составить из букв М, Е, Т, Р, О? Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка.", "answer": "150", "description": "Решение задачи на языке Python.", "python": "import itertools\ncounter = 0\nfor elem in itertools.product('МЕТРО', repeat=4):\n    word = ''.join(elem)\n    if word[0] in 'МТР' and word[-1] in 'ЕО':\n        counter += 1\nprint(counter)\n"}, {"id": "5", "text": "Вася составляет 6-буквенные слова, в которых есть только буквы К, А, Н, Т, причём буква К используется в каждом слове ровно 2 раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?", "answer": "1215", "description": "Решение задачи на языке Python.", "python": "import itertools\ncounter = 0\nfor elem in itertools.product('КАНТ', repeat=6):\n    word = ''.join(elem)\n    if word.count('К') == 2:\n        counter += 1\nprint(counter)\n"}, {"id": "6", "text": "Все 5-буквенные слова, составленные из 5 букв А, К, Л, О, Ш, записаны в алфавитном порядке. Вот начало списка:\n1. ААААА\n2. ААААК\n3. ААААЛ\n4. ААААО\n5. ААААШ\n6. АААКА\n...\nНа каком месте от начала списка стоит слово ШКОЛА?", "answer": "2711", "description": "Решение задачи на языке Python.", "python": "import itertools\ncounter = 0\nlist_of_words = [''.join(elem) for elem in itertools.product('АКЛОШ', repeat=5)]\nlist_of_words.sort()\nanswer = list_of_words.index('ШКОЛА')\nprint(answer + 1)\n"}, {"id": "7", "text": "Все 5-буквенные слова, составленные из букв А, О, У, записаны в алфавитном порядке. Вот начало списка:\n1. ААААА\n2. ААААО\n3. ААААУ\n4. АААОА\n...\nЗапишите слово, которое стоит на 240-м месте от начала списка.", "answer": "УУУОУ", "description": "Решение задачи на языке Python.", "python": "import itertools\ncounter = 0\nlist_of_words = [''.join(elem) for elem in itertools.product('АОУ', repeat=5)]\nlist_of_words.sort()\nprint(list_of_words[239])\n"}, {"id": "8", "text": "Все 5-буквенные слова, составленные из букв А, К, Р, У, записаны в алфавитном порядке. Вот начало списка:\n1. ААААА\n2. ААААК\n3. ААААР\n4. ААААУ\n5. АААКА\n...\nКакое количество слов находятся между словами РУКАА и УКАРА (включая эти слова)?", "answer": "121", "description": "Решение задачи на языке Python.", "python": "import itertools\ncounter = 0\nwords = [''.join(elem) for elem in itertools.product('АКРУ', repeat=5)]\nwords.sort()\nnew_words = words[words.index('РУКАА'):words.index('УКАРА') + 1]\nprint(len(new_words))\n"}, {"id": "9", "text": "Все 5-буквенные слова, составленные из букв П, О, Р, Т, записаны в алфавитном порядке и пронумерованы. Вот начало списка:\n1. ООООО\n2. ООООП\n3. ООООР\n4. ООООТ\n5. ОООПО\n...\nКакое количество слов находятся между словами ТОПОР и РОПОТ (включая эти слова)?", "answer": "256", "description": "Решение задачи на языке Python.", "python": "import itertools\ncounter = 0\nwords = [''.join(elem) for elem in itertools.product('ПОРТ', repeat=5)]\nwords.sort()\nnew_words = words[words.index('РОПОТ'):words.index('ТОПОР') + 1]\nprint(len(new_words))\n"}, {"id": "10", "text": "Все 4-буквенные слова, составленные из букв М, А, Р, Т, записаны в алфавитном порядке. Вот начало списка:\n1. АААА\n2. АААМ\n3. АААР\n4. АААТ\n...\nКакое количество слов находятся между словами МАРТ и РАМТ (включая эти слова)?", "answer": "61", "description": "Решение задачи на языке Python.", "python": "import itertools\ncounter = 0\nwords = [''.join(elem) for elem in itertools.product('МАРТ', repeat=4)]\nwords.sort()\nnew_words = words[words.index('МАРТ'):words.index('РАМТ') + 1]\nprint(len(new_words))\n"}, {"id": "11", "text": "У Ильи есть набор кубиков, выкрашенный во все семь цветов радуги. В наборе сорок два кубика, по 6 штук каждого цвета. Илья строит башенки, ставя кубики один на другой в один столбик так, чтобы соседние кубики были разного цвета. Сколько различных башенок высотой от 3 до 9 кубиков он может построить?", "answer": "14108724", "description": " Предположим, что у нас есть набор цветов \"А, Б, В,Г, Д, Е, Ж\", и нам нужно построить башню из 3 кубиков. Учитывая, что два кубика одного цвета не могут стоять рядом, получим следующее: первый кубик может быть любого цвета, к примеру, \"А\". Тогда второй кубик может быть цветов \"Б, В, Г, Д, Е, Ж\", к примеру \"Б\". Следовательно, третий кубик может быть цветов \"А, В, Г, Д, Е, Ж\", и т. д. Исходя из вышеописанного, можно составить программу (на языке Python) для вычисления ответа.", "python": "counter = 0\nfor i in range(2, 9):\n    counter += 7 * 6**i\nprint(counter)\n"}, {"id": "12", "text": "Аня составляет 6-значные числа в десятичной системе счисления. Цифры в числе не должны повторяться, и никакие две четные или две нечетные цифры не должны стоять рядом. Сколько чисел может составить Аня?", "answer": "6480", "description": "Имеем 10 цифр, из которых 5 чётных и 5 нечётных. Первой может быть любая цифра, кроме 0, следовательно, имеем 9 вариантов. Предположим, что первая цифра – чётная. Следующая цифра должна быть нечётной (всего 5 вариантов). Следующая цифра снова чётная (5 - 1 = 4 варианта, так как одна чётная цифра уже была использована). Число должно быть 6-значным, а значит, необходимо перемножить таким образом 6 возможных случаев. Пполучим выражение: 9 * 5 * 4 * 4 * 3 * 3 = 6480.", "python": "нет\n"}, {"id": "13", "text": "Сколько существует чётных пятеричных чисел длиной 6, начинающихся с цифры 3?", "answer": "1562", "description": "Важно помнить, что в системе счисления с нечётным основанием чётность числа зависит от суммы его цифр.\nИсходя из этого, можно составить программу (на языке Python) для вычисления ответа.", "python": "counter = 0\nfor b in range(5):\n    for c in range(5):\n        for d in range(5):\n            for e in range(5):\n                for f in range(5):\n                    if (3 + b + c + d + e + f) % 2 == 0:\n                        counter += 1\nprint(counter)\n"}, {"id": "14", "text": "Сколько шестнадцатеричных кодов чисел длиной 15 можно составить, если известно, что цифры идут в порядке убывания, при этом четные и нечетные цифры чередуются?", "answer": "2", "description": "Имеем алфавит 16-ричной системы счисления: \"0123456789ABCDEF\".\nПопробуем составить минимальное число, удовлетворяющее условию:\nПусть самая правая цифра – 0. Тогда левее этой цифры может быть только 1 – минимальная, нечётная цифра, которая больше нуля. Левее единицы – 2, и так далее.\nВ итоге получим: EDCBA9876543210. Цифра F не была использована. Но поставить её, например, вместо E в данном числе мы не можем, так как нарушится правило \"чередующиеся чётные и нечётные цифры\".\nЗначит, вторым и единственным оставшимся вариантом будет это число в обратном порядке (FEDCBA987654321).\nСледовательно, можно составить только 2 таких кода.", "python": "нет\n"}, {"id": "15", "text": "Сколько существует чисел, шестнадцатеричная запись которых содержит 3 цифры, причём все цифры различны и никакие две чётные и две нечётные цифры не стоят рядом?", "answer": "840", "description": "Имеем 16 цифр. Из них 8 чётных и 8 нечётных. Первой цифрой может быть любая цифра кроме нуля – 15 различных вариантов. Предположим, что первая цифра – чётная. Тогда следующая цифра должна быть нечётной (8 различных вариантов). Далее снова чётная цифра (7 вариантов, так как одна чётная цифра уже была использована). Соответственно, получим: 15 * 8 * 7 = 840 чисел.", "python": "нет"}]}