{"tasks":[{"id":"1","text":"Музыкальный фрагмент был оцифрован и записан в виде файла без использования сжатия данных. Получившийся файл был передан в город А по каналу связи за 30 секунд. Затем тот же музыкальный фрагмент был оцифрован повторно с разрешением в 2 раза выше и частотой дискретизации в 1,5 раза меньше, чем в первый раз. Сжатие данных не производилось. Полученный файл был передан в город Б; пропускная способность канала связи с городом Б в 4 раза выше, чем канала связи с городом А. Сколько секунд длилась передача файла в город Б? В ответе запишите только целое число, единицу измерения писать не нужно.","answer":"10","description":"Пусть размер первого получившегося файла x. Тогда размер второго — x * 2 : 1.5 = (4/3) * x. То есть он будет передаваться в 4/3 раза дольше. Пропускная способность канала в город Б выше в 4 раза, то есть время будет в 4 раза меньше, чем при передаче в город А. Итого получаем время: 30 * (4/3) : 4 = 10.\n"},{"id":"2","text":"Производилась двухканальная (стерео) звукозапись с частотой дискретизации 64 кГц и 24-битным разрешением. В результате был получен файл размером 48 Мбайт, сжатие данных не производилось. Определите приблизительно, сколько времени (в минутах) проводилась запись. В качестве ответа укажите ближайшее к времени записи целое число.","answer":"2","description":"Так как частота дискретизации 64 кГц, то за одну секунду запоминается 64000 значений сигнала.\nГлубина кодирования 24 бита, т. е. 3 байта. Т. к. запись двухканальная, объём памяти, необходимый для хранения данных одного канала, умножается на 2, поэтому, так как потребовалось 48 Мбайт, один канал занимает 24 Мбайт или 24·220 байт. Чтобы найти время, в течение которого проводилась запись, необходимо разделить найденный информационный объем на глубину кодирования и на частоту дискретизации:\n(24 * 2^20) / 64000 * 3 = 2^20 / 8000 = 131,072 с ≈  2 мин 11 с.\nТем самым, время записи примерно равно 2 минутам.\n"},{"id":"3","text":"Текстовый документ, состоящий из 3072 символов, хранился в 8-битной кодировке КОИ-8. Этот документ был преобразован в 16-битную кодировку Unicode. Укажите, какое дополнительное количество Кбайт потребуется для хранения документа. В ответе запишите только число.","answer":"3","description":"Объем информации в кодировке КОИ-8: 3072 символов * 1 байт = 3072 байта.\nОбъем информации в 16-битной кодировке: 3072 символов * 2 байта = 6144 байта.\n6144 байта - 3072 байта = 3072 байта.\n3072 : 1024 = 3 Кбайта.\n"},{"id":"4","text":"Документ объемом 5 Мбайт можно передать с одного компьютера на другой двумя способами:\nА) Сжать архиватором, передать архив по каналу связи, распаковать.\nБ) Передать по каналу связи без использования архиватора.\nКакой способ быстрее и насколько, если\n– средняя скорость передачи данных по каналу связи составляет 218 бит в секунду,\n– объем сжатого архиватором документа равен 80% от исходного,\n– время, требуемое на сжатие документа – 35 секунд, на распаковку – 3 секунды?\nВ ответе напишите букву А, если способ А быстрее или Б, если быстрее способ Б. Сразу после буквы напишите количество секунд, насколько один способ быстрее другого. Так, например, если способ Б быстрее способа А на 23 секунды, в ответе нужно написать Б23.","answer":"Б6","description":"Способ А. Общее время складывается из времени сжатия, распаковки и передачи. Время передачи t рассчитывается по формуле t = Q / q, где Q — объём информации, q — cкорость передачи данных.\nНайдём сжатый объём: 5 * 0,8 = 4 Мбайта\nПереведём Q из Мбайт в биты: 4 Мбайта = 4 * 220 байт = 4 * 223 бит.\nНайдём общее время: t = 35 с + 3 с + 4 * 223 бит / 218 бит/с = 38 + 27 с = 166 с.\nСпособ Б. Общее время совпадает с временем передачи: t = 5 * 223 бит / 218 бит/с = 5 * 25 с = 160 с.\nВидно, что способ Б быстрее на 166 - 160 = 6 с.\n"},{"id":"5","text":"Автоматическая фотокамера производит растровые изображения размером 1024 на 600 пикселей. При этом объём файла с изображением не может превышать 300 Кбайт, упаковка данных не производится. Какое максимальное количество цветов можно использовать в палитре?","answer":"16","description":"Объём растрового изображения находится как произведение количества пикселов в изображении на объём памяти x, необходимый для хранения цвета одного пиксела: 1024 · 600 · x ≤ 300 · 213 бит, откуда x = 4 бит. Значит, в изображении можно использовать не более 24 = 16 цветов.\n"},{"id":"6","text":"Музыкальный фрагмент был записан в формате стерео (двухканальная запись), оцифрован и сохранён в виде файла без использования сжатия данных. Размер полученного файла без учёта размера заголовка файла — 48 Мбайт. Затем тот же музыкальный фрагмент был записан повторно в формате моно и оцифрован с разрешением в 1,5 раза выше и частотой дискретизации в 3 раза меньше, чем в первый раз. Сжатие данных не производилось. Укажите размер в Мбайт файла, полученного при повторной записи. В ответе запишите только целое число, единицу измерения писать не нужно. Искомый объём не учитывает размера заголовка файла.","answer":"12","description":"Найдём размер файла, получившегося при повторной записи: 48 * 1.5 / 2 * 3 = 12\n"},{"id":"7","text":"Музыкальный фрагмент был оцифрован и записан в виде файла без использования сжатия данных. Получившийся файл был передан в город А по каналу связи за 15 секунд. Затем тот же музыкальный фрагмент был оцифрован повторно с разрешением в 2 раза выше и частотой дискретизации в 1,5 раза меньше, чем в первый раз. Сжатие данных не производилось. Полученный файл был передан в город Б; пропускная способность канала связи с городом Б в 2 раза выше, чем канала связи с городом А. Сколько секунд длилась передача файла в город Б? В ответе запишите только целое число, единицу измерения писать не нужно.","answer":"10","description":"Объём файла прямо пропорционален разрешению файла и его частоте дискретизации, следовательно, объём файла во втором случае в 2/1,5 = 4/3 раза больше. Длительность передачи обратно пропорциональна пропускной способности канала связи, откуда получаем, что длительность передачи файла во второй раз равна: 15 · (1/2) · (4/3) = 10.\n"},{"id":"8","text":"Для хранения в информационной системе документы сканируются с разрешением 600 dpi и цветовой системой, содержащей 224 = 16 777 216 цветов. Методы сжатия изображений не используются. Средний размер отсканированного документа составляет 12 Мбайт. В целях экономии было решено перейти на разрешение 300 dpi и цветовую систему, содержащую 2^16 = 65 536 цветов. Сколько Мбайт будет составлять средний размер документа, отсканированного с изменёнными параметрами?","answer":"2","description":"Разрешение изображения изменилось с 600 dpi на 300 dpi. Это значит, что оно изменилось в 600*600/300*300 = 4 раза. Глубина цвета была изменена в 24/16=1.5 раза. Следовательно, средний размер документа, отсканированного с изменёнными параметрами равняется 12/4*1.5=2 Мбайт.\n"},{"id":"9","text":"Производится звукозапись музыкального фрагмента в формате стерео (двухканальная запись) с частотой дискретизации 32 кГц и 32-битным разрешением. Результаты записываются в файл, сжатие данных не производится; размер полученного файла 40 Мбайт. Затем производится повторная запись этого же фрагмента в формате моно (одноканальная запись) с частотой дискретизации 16 кГц и 16-битным разрешением. Сжатие данных не производилось. Укажите размер файла в Мбайт, полученного при повторной записи. В ответе запишите только целое число, единицу измерения писать не нужно.","answer":"5","description":"Получаем систему:\n40 (Мбайтах) = 2 (количество каналов) · 32000 (частота) · 4 (разрешение в байтах) · X (время в секундах)\nV (Мбайтах) = 1 (количество каналов) · 16000 (частота) · 2 (разрешение в байтах) · X (время в секундах)\nТогда, v = 40/(2 · 2 · 2) = 5 Мбайт.\n"},{"id":"10","text":"Для хранения произвольного растрового изображения размером 128 × 320 пикселей отведено 30 Кбайт памяти без учёта размера заголовка файла. Для кодирования цвета каждого пикселя используется одинаковое количество битов, коды пикселей записываются в файл один за другим без промежутков. Какое максимальное количество цветов можно использовать в изображении?","answer":"64","description":"Объём растрового изображения находится как произведение количества пикселей в изображении на объём памяти x, необходимый для хранения цвета одного пикселя: 128 · 320 · x < 30 · 2^13 бит, откуда x = 6 бит. Значит, в изображении можно использовать не более 2^6 = 64 цвета.\n"},{"id":"11","text":"Для хранения произвольного растрового изображения размером 1536 × 2048 пикселей отведено не более 6 Мбайт памяти без учёта размера заголовка файла. Для кодирования цвета каждого пикселя используется одинаковое количество бит, коды пикселей записываются в файл один за другим без промежутков. Какое максимальное количество цветов можно использовать в изображении?","answer":"65536","description":"Объём растрового изображения находится как произведение количества пикселов в изображении на объём памяти x, необходимый для хранения цвета одного пиксела: 1536 · 2048 · x ≤ 6 · 2^23 бит, откуда x = 16 бит. Значит, в изображении можно использовать не более 2^16 = 65536 цветов.\n"},{"id":"12","text":"Для хранения сжатого произвольного растрового изображения размером 192 на 960 пикселей отведено 90 Кбайт памяти без учёта размера заголовка файла. При сжатии объём файла уменьшается на 35%. Для кодирования цвета каждого пикселя используется одинаковое количество бит, коды пикселей записываются в файл один за другим без промежутков. Какое максимальное количество цветов можно использовать в изображении?","answer":"64","description":"Сначала найдём объём несжатого изображения: 90 / 0,65 ≈ 138.  Объём растрового изображения находится как произведение количества пикселей в изображении на объём памяти x, необходимый для хранения цвета одного пикселя: 192 · 960 · x < 138 · 213 бит, откуда x = 6 бит. Значит, в изображении можно использовать не более 2^6 = 64 цвета.\n"},{"id":"13","text":"Какой минимальный объём памяти (в Кбайт) нужно зарезервировать, чтобы можно было сохранить любое растровое изображение размером 640 на 320 пикселей при условии, что в изображении могут использоваться 64 различных цвета? В ответе запишите только целое число, единицу измерения писать не нужно.","answer":"150","description":"Один пиксель кодируется 6 битами памяти, так как 26 = 64.\nВсего 640 · 320 = 26 · 25 · 100 = 211 · 100 пикселей.\nТогда объем памяти, занимаемый изображением 211 · 100 · 6 бит = 28 · 100 · 6 байт = 50 · 3 Кбайт = 150 Кбайт.\n"},{"id":"14","text":"Музыкальный фрагмент был записан в формате квадро (четырёхканальная запись), оцифрован и сохранён в виде файла без использования сжатия данных. Размер полученного файла без учёта размера заголовка файла  — 12 Мбайт. Затем тот же музыкальный фрагмент был записан повторно в формате моно и оцифрован с разрешением в 2 раза выше и частотой дискретизации в 1,5 раза меньше, чем в первый раз. Сжатие данных не производилось. Укажите размер в Мбайт файла, полученного при повторной записи. В ответе запишите только целое число, единицу измерения писать не нужно. Искомый объём не учитывает размера заголовка файла.","answer":"4","description":"Найдём размер файла, получившегося при повторной записи:\n 12*2/(1.5*4) = 4\n"},{"id":"15","text":"Для проведения эксперимента записывается звуковой фрагмент в формате стерео (двухканальная запись) с частотой дискретизации 32 кГц и 32-битным разрешением. Результаты записываются в файл, сжатие данных не производится; дополнительно в файл записывается служебная информация, необходимая для эксперимента, размер полученного файла 42 Мбайт. Затем производится повторная запись этого же фрагмента в формате моно (одноканальная запись) с частотой дискретизации 16 кГц и 16-битным разрешением. Результаты тоже записываются в файл без сжатия и со служебной информацией, размер полученного файла 7 Мбайт. Объём служебной информации в обоих случаях одинаков. Укажите этот объём в мегабайтах. В ответе укажите только число (количество Мбайт), единицу измерения указывать не надо.","answer":"2","description":"Получаем систему:\n42 · 220 (байт)  =  2 (количество каналов) · 32000 (частота) · 4 (разрешение в байтах) · T (время в секундах) + X (объём служебной информации)\n7 · 220 (байт)  =  1 (количество каналов) · 16000 (частота) · 2 (разрешение в байтах) · T (время в секундах) + X (объём служебной информации)\nПолучаем систему уравнений с двумя неизвестными. Чтобы избавиться от T умножим второе уравнение на 8, получим:\n42 · 220 (байт)  =  2 (количество каналов) · 32000 (частота) · 4 (разрешение в байтах) · T (время в секундах) + X (объём служебной информации)\n56 · 220 (байт)  =  8 ·  1 (количество каналов) · 16000 (частота) · 2 (разрешение в байтах) · T (время в секундах) +  8 ·X (объём служебной информации)\nВычтем из второго уравнение первое, получим:\n14 · 220 (байт)  =  7 ·X (объём служебной информации)\nПреобразовав уравнение, получаем: X  =  2 · 220 (байт) = 2 Мбайт.\n"},{"id":"16","text":"Автоматическая камера производит растровые изображения размером 200×256 пикселей. Для кодирования цвета каждого пикселя используется одинаковое количество бит, коды пикселей записываются в файл один за другим без промежутков. Объём файла с изображением не может превышать 65 Кбайт без учёта размера заголовка файла. Какое максимальное количество цветов можно использовать в палитре?","answer":"1024","description":"Объём растрового изображения находится как произведение количества пикселов в изображении на объём памяти x, необходимый для хранения цвета одного пиксела: 200 · 256 · x ≤ 65 · 210 · 23 бит, откуда x ≤ 65 · 210 · 23/(28 · 200), откуда находим x = 10,4 = 10 бит. Значит, в изображении можно использовать не более 210 = 1024 цветов.\n"},{"id":"17","text":"Для хранения произвольного растрового изображения размером 128×320 пикселей отведено 20 Кбайт памяти без учёта размера заголовка файла. Для кодирования цвета каждого пикселя используется одинаковое количество бит, коды пикселей записываются в файл один за другим без промежутков. Какое максимальное количество цветов можно использовать в изображении?","answer":"16","description":"Объём растрового изображения находится как произведение количества пикселей в изображении на объём памяти x, необходимый для хранения цвета одного пикселя: 128 · 320 · x < 20 · 213 бит, откуда x = 4 бит. Значит, в изображении можно использовать не более 24 = 16 цветов.\n"},{"id":"18","text":"Для проведения эксперимента записывается звуковой фрагмент в формате квадро (четырёхканальная запись) с частотой дискретизации 32 кГц и 32-битным разрешением. Результаты записываются в файл, сжатие данных не производится; дополнительно в файл записывается служебная информация, необходимая для эксперимента, размер полученного файла 97 Мбайт. Затем производится повторная запись этого же фрагмента в формате моно (одноканальная запись) с частотой дискретизации 16 кГц и 16-битным разрешением. Результаты тоже записываются в файл без сжатия и со служебной информацией, размер полученного файла 7 Мбайт. Объём служебной информации в обоих случаях одинаков. Укажите этот объём в мегабайтах. В ответе укажите только число (количество Мбайт), единицу измерения указывать не надо.","answer":"1","description":"Получаем систему:\n97 · 220 (байт)  =  4 (количество каналов) · 32000 (частота) · 4 (разрешение в байтах) · T (время в секундах) + X (объём служебной информации)\n7 · 220 (байт) =1 (количество каналов) · 16000 (частота) · 2 (разрешение в байтах) · T (время в секундах) + X (объём служебной информации)\nПреобразовав систему, получаем: X  =  216 · 15 · 16 / 15 = 220 байт  =  1 Мбайт.\n"},{"id":"19","text":"Автоматическая фотокамера производит растровые изображения размером 480 на 640 пикселей. При этом объём файла с изображением не может превышать 40 Кбайт, упаковка данных не производится. Какое максимальное количество цветов можно использовать в палитре?","answer":"2","description":"Объём растрового изображения находится как произведение количества пикселов в изображении на объём памяти x, необходимый для хранения цвета одного пиксела: 480 · 640 · x < 40 · 213 бит, откуда x < 1 бит = 1 бит. Значит, в изображении можно использовать не более 21 = 2 цветов.\n"},{"id":"20","text":"Автоматическая фотокамера производит растровые изображения размером 640×480 пикселей. При этом объём файла с изображением не может превышать 320 Кбайт, упаковка данных не производится. Какое максимальное количество цветов можно использовать в палитре?","answer":"256","description":"Объём растрового изображения находится как произведение количества пикселей в изображении на объём памяти x, необходимый для хранения цвета одного пикселя: 640 · 480 · x ≤ 320 · 210 · 23 бит, откуда x ≤ 25 · 210 · 23/(211 · 15), откуда находим x = 8 бит. Значит, в изображении можно использовать не более 28 = 256 цветов."}]}