{'tasks': [{'id': '1', 'text': 'Обозначим через m & n поразрядную конъюнкцию неотрицательных целых чисел m и n.\nТак, например, 14 & 5 = 11102 & 01012 = 01002 = 4. Для какого наименьшего неотрицательного целого числа А формула\nx & 29 ≠ 0 → (x & 17 = 0 → x & А ≠ 0)\nтождественно истинна (т. е. принимает значение 1 при любом неотрицательном целом значении переменной x)?', 'answer': '12', 'description': 'Решение задачи методом перебора на языке Python.', 'python': 'ok=1\nA=set()\nfor a in range (1, 65):\n   ok=1\n   for x in range (0, 65):\n      if ((x & 29 != 0) <= ((x & 17 == 0) <= (x & a != 0))) == 0:\n         ok=0\n   if ok:\n      A.add(a)\n      break\nprint(min(A))\n'}, {'id': '2', 'text': 'На числовой прямой даны два отрезка: P = [5, 30] и Q = [14, 23]. Укажите наибольшую возможную длину промежутка A, для которого формула\n((x ∈ P) ≡ (x ∈ Q)) → ¬(x ∈ A)\nтождественно истинна, то есть принимает значение 1 при любом значении переменной х.', 'answer': '9', 'description': 'Введем обозначения:\n(x ∈ P) ≡ P; (x ∈ Q) ≡ Q; (x ∈ A) ≡ A.\nТогда, применив преобразование импликации, получаем:\n¬(P ≡ Q) ∨ ¬A ⇔ ¬(P ≡ Q) ∨ ¬A = 1.\nВыражение ¬(P ≡ Q) истинно только тогда, когда x ∈ [5; 14) и x ∈ (23; 30]. В таком случае, для того, чтобы выражение было истинно при любом x, A должно лежать либо в промежутке [5; 14), либо (23; 30]. Следовательно, наибольшая возможная длина промежутка равна 14 − 5 = 9.', 'python': 'нет\n'}, {'id': '3', 'text': 'Элементами множеств А, P, Q являются натуральные числа, причём P = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}, Q = {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}. Известно, что выражение\n( (x ∈ A) → (x ∈ P) ) ∧ ( (x ∈ Q) → ¬(x ∈ A) )\nистинно (то есть принимает значение 1) при любом значении переменной х. Определите наибольшее возможное количество элементов в множестве A.', 'answer': '7', 'description': 'Введем обозначения:\n(x ∈ P) ≡ P; (x ∈ Q) ≡ Q; (x ∈ A) ≡ A; ∧ ≡ · ; ∨ ≡ +.\nТогда, применив преобразование импликации, получаем:\n(¬A + P) · (¬Q + ¬A) ⇔ ¬A · ¬Q + ¬Q · P + ¬A + ¬A · P ⇔\n⇔ ¬A · (¬Q + P + 1) + ¬Q · P ⇔ ¬A + ¬Q · P.\nТребуется чтобы ¬A + ¬Q · P = 1. Выражение ¬Q · P истинно когда x ∈ {2, 4, 8, 10, 14, 16, 20}. Тогда ¬A должно быть истинным когда x ∈ {1, 3, 5, 6, 7, 9, 11, 12, 13, 15, 17, 18, 19, 21, 22, 23,...}.\nСледовательно, максимальное количество элементов в множестве A будет, если A включает в себя все элементы множества ¬Q · P, таких элементов семь.', 'python': 'нет'}]}
