{"tasks":[{"id":"1","text":"Определите, сколько раз в сносках приложенного издания произведения А. С. Пушкина «Капитанская дочка» встречается слово «царский» в любой форме.","answer":"3","description":"Воспользуемся поисковыми средствами текстового редактора. В строке введём «царск». Всего будет найдено пять вхождений. Среди них в сносках встречается только три.\n"},{"id":"2","text":"Определите, сколько раз, включая эпиграфы и названия глав, в тексте произведения А. С. Пушкина «Капитанская дочка» встречается слово «граф» в любом падеже.","answer":"3","description":"Воспользуемся поисковыми средствами текстового редактора. В строке введём «граф». Подсчитав общее количество результатов и исключив лишние, получаем ответ  — 3.\n"},{"id":"3","text":"Определите, сколько раз в тексте произведения А. С. Пушкина «Дубровский» встречается существительное «пир» в любом числе и падеже.","answer":"1","description":"Воспользуемся поисковыми средствами текстового редактора. В строке введём «пир». Подсчитав общее количество результатов и исключив лишние, получаем ответ  — 1.\n"},{"id":"4","text":"Определите, сколько раз в тексте поэмы Н. А. Некрасова «Кому на Руси жить хорошо» встречается слово «Мой» написанное с прописной буквы. Другие формы слова «Мой», такие как «Мои», «Моего» и прочие учитывать не следует.","answer":"5","description":"Вызовем меню замены и настроим замены по заданию. Слово «Мой», установим флажок «Только слово целиком» и флажок «Учитывая регистр».\n\nНажмем «Заменить все». Во всплывающем окне увидим количество замен: 5\n"},{"id":"5","text":"С помощью текстового редактора определите, сколько раз, не считая сносок, встречается слово «долг» или «Долг» в тексте романа в стихах А. С. Пушкина «Евгений Онегин». Другие формы слова «долг», такие как «долги», «долгами» и т. д., учитывать не следует. В ответе укажите только число.","answer":"1","description":"Воспользуемся поисковыми средствами текстового редактора. В строке поиска последовательно будем вводить сначала « долг», потом «Долг ». Подсчитав общее количество результатов, получаем ответ  — 1.\n"},{"id":"6","text":"Текст произведения Льва Николаевича Толстого «Севастопольские рассказы» представлен в виде файлов различных форматов. Откройте один из файлов и определите, сколько раз встречается в тексте отдельное слово «теперь» со строчной буквы. Другие формы этого слова учитывать не следует. В ответе запишите только число.","answer":"45","description":"Воспользуемся поисковыми средствами текстового редактора. В строке поиска введём «теперь». Подсчитав общее количество результатов, получаем ответ  — 45.\n"},{"id":"7","text":"Определите, сколько раз в тексте произведения А. С. Пушкина «Капитанская дочка» встречается слово «картина» в любом падеже.","answer":"1","description":"Воспользуемся поисковыми средствами текстового редактора. В строке введём слово «картин». Текстовый редактор отобразит 3 позиции, однако аннотация не входит в текст произведения и слово «картинки» не подходит, получаем ответ  — 1.\n"},{"id":"8","text":"С помощью текстового редактора определите, сколько раз, не считая сносок, встречается слово «звук» или «Звук» в тексте романа в стихах А. С. Пушкина «Евгений Онегин». Другие формы слова «звук», такие как «звуки», «звучание» и т. д., учитывать не следует. В ответе укажите только число.","answer":"1","description":"Воспользуемся поисковыми средствами текстового редактора. В строке поиска введем слово «звук». Подсчитав общее количество результатов, получаем ответ  — 1.\n"},{"id":"9","text":"Определите, сколько раз в тексте произведения Н. В. Гоголя «Нос» встречается слово «полный» в любом числе и падеже.","answer":"3","description":"Воспользуемся поисковыми средствами текстового редактора. В строке введём «полн». Подсчитав общее количество результатов и исключив лишние, получаем ответ  — 3.\n"},{"id":"10","text":"Определите, сколько раз, включая эпиграфы и названия глав, в тексте произведения А. С. Пушкина «Капитанская дочка» встречается слово «арест» в любом падеже.","answer":"5","description":"Воспользуемся поисковыми средствами текстового редактора. В строке введём «арест». Подсчитав общее количество результатов и исключив лишние, получаем ответ  — 5.\n"},{"id":"11","text":"Определите, сколько раз в тексте произведения А. С. Пушкина «Дубровский» встречается существительное «борода» в любом числе и падеже.","answer":"2","description":"Воспользуемся поисковыми средствами текстового редактора. В строке введём «бород». Подсчитав общее количество результатов и исключив лишние, получаем ответ  — 2.\n"},{"id":"12","text":"Определите, сколько раз в тексте произведения А. С. Грибоедова «Горе от ума», не считая сносок, встречается слово «батюшка» или «Батюшка». Другие формы слова «батюшка», такие как «батюшке», «батюшки» и т. д., учитывать не следует. В ответе укажите только число.","answer":"20","description":"Воспользуемся поисковыми средствами текстового редактора. В строке введём «батюшка». Подсчитав общее количество результатов и исключив лишние, получаем ответ  — 20.\n"},{"id":"13","text":"Определите, сколько раз в тексте произведения А. С. Пушкина «Дубровский» встречается существительное «ключ» в любом числе и падеже.","answer":"6","description":"Воспользуемся поисковыми средствами текстового редактора. В строке введём «ключ». Подсчитав общее количество результатов и исключив лишние, получаем ответ  — 6.\n"},{"id":"14","text":"Определите, сколько раз в тексте произведения А. С. Пушкина «Капитанская дочка» встречается имя Емельян в любом падеже.","answer":"2","description":"Воспользуемся поисковыми средствами текстового редактора. В строке введём слово «Емельян». Текстовый редактор отобразит 3 позиции, однако аннотация не входит в текст произведения, получаем ответ  — 2.\n"},{"id":"15","text":"С помощью текстового редактора определите, сколько раз, не считая сносок, встречается слово «вы» или «Вы» в тексте романа в стихах А. С. Пушкина «Евгений Онегин». Другие формы слова «вы» учитывать не следует. В ответе укажите только число.","answer":"13","description":"Воспользуемся поисковыми средствами текстового редактора. В строке поиска введем сначала «вы», потом «Вы ». Подсчитав общее количество результатов и исключив лишние, получаем ответ  — 13.\n"},{"id":"16","text":"С помощью текстового редактора определите, сколько раз, не считая сносок, встречается слово «ты» или «Ты» в тексте романа в стихах А. С. Пушкина «Евгений Онегин». Другие формы слова «ты», такие как «твой» и т. д., учитывать не следует. В ответе укажите только число.","answer":"2","description":"Воспользуемся поисковыми средствами текстового редактора. В строке поиска введем сначала « ты», потом «Ты ». Подсчитав общее количество результатов и исключив лишние, получаем ответ  — 2.\n"},{"id":"17","text":"С помощью текстового редактора определите, сколько раз, не считая сносок, встречается слово «его» или «Его» в тексте романа в стихах А. С. Пушкина «Евгений Онегин». Другие формы слова «его» учитывать не следует. В ответе укажите только число.","answer":"21","description":"Воспользуемся поисковыми средствами текстового редактора. В строке поиска введем слово «его». Подсчитав общее количество результатов, получаем ответ  — 21.\n"},{"id":"18","text":"С помощью текстового редактора определите, сколько раз, не считая сносок, встречается слово «север» или «Север» в тексте романа в стихах А. С. Пушкина «Евгений Онегин». Другие формы слова «север», такие как «севера», «северяне» и т. д., учитывать не следует. В ответе укажите только число.","answer":"1","description":"Воспользуемся поисковыми средствами текстового редактора. В строке поиска введем слово «север». Подсчитав общее количество результатов, получаем ответ  — 1.\n"},{"id":"19","text":"С помощью текстового редактора определите, сколько раз, не считая сносок, встречается слово «Онегин» в тексте романа в стихах А. С. Пушкина «Евгений Онегин». Другие формы слова «Онегин», такие как «Онегина», «Онегиным» и т. д., учитывать не следует. В ответе укажите только число.","answer":"12","description":"Воспользуемся поисковыми средствами текстового редактора. В строке поиска введем слово «Онегин». Подсчитав общее количество результатов, получаем ответ  — 12.\n"},{"id":"20","text":"Определите, сколько раз в тексте произведения А. С. Пушкина «Капитанская дочка» встречается слово «дочка» или «Дочка». Другие формы этого слова («дочку», «дочки» и т. д.) учитывать не надо.","answer":"1","description":"Воспользуемся поисковыми средствами текстового редактора. В строке поиска последовательно будем вводить сначала \" дочка\", потом \"Дочка \". Подсчитав общее количество результатов, получаем ответ  — 1."}]}