{'tasks': [{'id': '1', 'text': 'Имеется набор данных, состоящий из пар положительных целых чисел. Необходимо выбрать из каждой пары ровно одно число так, чтобы сумма всех выбранных чисел не делилась на 3 и при этом была минимально возможной. Гарантируется, что искомую сумму получить можно. Программа должна напечатать одно число — минимально возможную сумму, соответствующую условиям задачи.\nДаны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество пар N (1 ≤ N ≤ 100000). Каждая из следующих N строк содержит два натуральных числа, не превышающих 10 000.\nВ ответе укажите два числа: сначала значение искомой суммы для файла А, затем для файла B.\nПредупреждение: для обработки файла B не следует использовать переборный алгоритм, вычисляющий сумму для всех возможных вариантов, поскольку написанная по такому алгоритму программа будет выполняться слишком долго.', 'answer': '67088 200157478', 'description': 'Решение задачи на языке Python.', 'python': "f = open('1_A.txt')\nn = int(f.readline())\ns = 0\nminn = 20001\nd = 0\nfor i in range(n):\n    x, y = map(int, f.readline().split())\n    s += min(x, y)\n    d = abs(x-y)\n    if d % 3 != 0:\n        minn = min(d, minn)\nif s % 3 !=0:\n    print(s)\nelse:\n    print(s+minn)\nf.close()\n"}, {'id': '2', 'text': 'Имеется набор данных, состоящий из пар положительных целых чисел. Необходимо выбрать из каждой пары ровно одно число так, чтобы сумма всех выбранных чисел не делилась на 5 и при этом была максимально возможной. Гарантируется, что искомую сумму получить можно. Программа должна напечатать одно число — максимально возможную сумму, соответствующую условиям задачи.\nДаны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество пар N (1 ≤ N ≤ 100000). Каждая из следующих N строк содержит два натуральных числа, не превышающих 10 000.\nВ ответе укажите два числа: сначала значение искомой суммы для файла А, затем для файла B.\nПредупреждение: для обработки файла B не следует использовать переборный алгоритм, вычисляющий сумму для всех возможных вариантов, поскольку написанная по такому алгоритму программа будет выполняться слишком долго.', 'answer': '118951 394491666', 'description': 'Решение задачи на языке Python.', 'python': "f = open('2_B.txt')\nn = int(f.readline())\ns, minn = 0, 20001\nfor i in range(n):\n    x, y = map(int, f.readline().split())\n    s += max(x, y)\n    d = abs(x - y)\n    if d % 5 != 0 :\n        minn = min(d, minn)\nif s % 5 != 0:\n    print(s)\nelse:\n    print(s - minn)"}]}
