{"tasks": [{"id": "1", "text": "Логическая функция F задаётся выражением:\n(¬x ∧ y ∧ z) ∨ (¬x ∧ ¬y ∧ z) ∨ (¬x ∧ ¬y ∧ ¬z).\nНа рисунке приведён фрагмент таблицы истинности функции F, содержащий все наборы аргументов, при которых функция F истинна.\nОпределите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z.\nВ ответе напишите буквы x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала – буква, соответствующая первому столбцу, затем – буква, соответствующая второму столбцу, и т. д.) Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.", "answer": "zxy", "description": "Рассмотрим данное выражение. Оно равно единице в трех случаях: (¬x ∧ y ∧ z) = 1, (¬x ∧ ¬y ∧ z) = 1 или (¬x ∧ ¬y ∧ ¬z) = 1. Каждое из этих равенств выполняется только при одном наборе переменных. Первое: x = 0, y = 1, z = 1. Второе: x = 0, y = 0, z = 1. Третье: x = y = z = 0. Так, из второго значения функции видим, что переменная 1 — z. А из третьего, что переменная 2 — x, тогда переменная 3 — y.\n"}, {"id": "2", "text": "Логическая функция F задаётся выражением (¬z)∧x ∨ x∧y.\nОпределите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z.\nВ ответе напишите буквы x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала – буква, соответствующая 1-му столбцу; затем – буква, соответствующая 2-му столбцу; затем – буква, соответствующая 3-му столбцу). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.", "answer": "zyx", "description": "Данное выражение является дизъюнкцией двух конъюнкций. Можем заметить, что в обоих слагаемых есть множитель x. Т. е. при x = 0 сумма будет равна 0. Так, для переменной x подходит только третий столбец. Шестое значение функции равно 0 при x = 1. Такое возможно только при z = 1, у = 0, т. е. переменная 1 − z, а переменная 2 − y.\n"}, {"id": "3", "text": "Логическая функция F задаётся выражением (x ∨ y) → (z ≡ x).\nДан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.\nВ ответе напишите буквы x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала – буква, соответствующая первому столбцу; затем – буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.", "answer": "xzy", "description": "Данная импликация принимает значение 0 тогда и только тогда, когда x + y = 1 и x ≠ z.\nПусть x = 0, тогда y = z = 1. В первой строке нет двух единиц, значит, x = 1, и эта переменная находится в первом столбце. Тогда первая строка имеет вид 1 0 0. Вторая строка должна отличаться от первой, поэтому она имеет вид 1 0 1. Двум условиям из начала решения удовлетворяет случай, когда столбцы расположены в порядке x, z, y.\n"}, {"id": "4", "text": "Каждое из логических выражений F и G содержит 5 переменных. В таблицах истинности выражений F и G есть ровно 5 одинаковых строк, причём ровно в 4 из них в столбце значений стоит 1.\nСколько строк таблицы истинности для выражения F ∨ G содержит 1 в столбце значений?", "answer": "31", "description": "На 4 наборах входных переменных оба выражения равны 1, на 1 наборе оба равны 0, а на всех остальных одно из них равно 0, а другое 1. Поэтому если взять \"логическое или\" от этих двух выражений, то на том наборе, на котором они оба были равны 0, полученное выражение будет равно 0, на всех же остальных наборах хотя бы одно из них будет равно 1, поэтому и итоговое выражение будет равно 1. Всего различных наборов 32, из них на одном 0, то есть на 31 оставшихся наборах будет 1."}]}