{'tasks': [{'id': '1', 'text': 'Системный администратор раз в неделю создаёт архив пользовательских файлов. Однако объём диска, куда он помещает архив, может быть меньше, чем суммарный объём архивируемых файлов. Известно, какой объём занимает файл каждого пользователя.\nПо заданной информации об объёме файлов пользователей и свободном объёме на архивном диске определите максимальное число пользователей, чьи файлы можно сохранить в архиве, а также максимальный размер имеющегося файла, который может быть сохранён в архиве, при условии, что сохранены файлы максимально возможного числа пользователей.\nВ первой строке входного файла находятся два числа: S — размер свободного места на диске (натуральное число, не превышающее 10 000) и N — количество пользователей (натуральное число, не превышающее 1000). В следующих N строках находятся значения объёмов файлов каждого пользователя (все числа натуральные, не превышающие 100), каждое в отдельной строке.\nЗапишите в ответе два числа: сначала наибольшее число пользователей, чьи файлы могут быть помещены в архив, затем максимальный размер имеющегося файла, который может быть сохранён в архиве, при условии, что сохранены файлы максимально возможного числа пользователей. Запишите числа через пробел.', 'answer': '568 50', 'description': 'Решение задачи на языке Python.', 'python': "var \ni, j, t: integer;\na: array [1..1000] of integer;\ns: integer;\nn: integer;\nsum: integer;\nmaxi: integer;\nf: text;\nbegin\n    assign(f,'C:\\1.txt');\n    reset(f);\n    readln(f, s, n);\n    for i := 1 to n do readln(f, a[i]);\n    for i := 1 to n do\n        for j := i + 1 to n do \n            if a[i] > a[j] then begin\n                t := a[i];\n                a[i] := a[j];\n                a[j] := t;\n            end;\n    sum := 0;\n    maxi := 1;\n    for i := 1 to n do\n        if sum + a[i] <= s then begin\n            sum := sum + a[i];\n            maxi := i;\n        end;\n    t := a[maxi];\n    for i := maxi to n do\n        if ((sum - t) + a[i]) <= s then begin\n            sum := sum - t + a[i];\n            t := a[i];\n        end;\n    writeln(maxi, ' ', t);\nend.\n"}, {'id': '2', 'text': 'Системный администратор раз в неделю создаёт архив пользовательских файлов. Однако объём диска, куда он помещает архив, может быть меньше, чем суммарный объём архивируемых файлов. Известно, какой объём занимает файл каждого пользователя.\nПо заданной информации об объёме файлов пользователей и свободном объёме на архивном диске определите максимальное число пользователей, чьи файлы можно сохранить в архиве, а также максимальный размер имеющегося файла, который может быть сохранён в архиве, при условии, что сохранены файлы максимально возможного числа пользователей.\nВ первой строке входного файла находятся два числа: S — размер свободного места на диске (натуральное число, не превышающее 10 000) и N — количество пользователей (натуральное число, не превышающее 4000). В следующих N строках находятся значения объёмов файлов каждого пользователя (все числа натуральные, не превышающие 100), каждое в отдельной строке.\nЗапишите в ответе два числа: сначала наибольшее число пользователей, чьи файлы могут быть помещены в архив, затем максимальный размер имеющегося файла, который может быть сохранён в архиве, при условии, что сохранены файлы максимально возможного числа пользователей. Запишите числа через пробел.', 'answer': '611 27', 'description': 'Решение задачи на языке Python.', 'python': "f = open('2.txt')\ns, n = map(int, f.readline().split())\nv = sorted(map(int, f))\nsum, cnt = 0, 0\n\u3000for i in range(len(v)):\n\u3000\u3000if sum + v[i] <= s:\n\u3000\u3000\u3000sum += v[i]\n\u3000\u3000\u3000cnt += 1\nbiggest_file = v[cnt - 1:][0] + s - sum\nwhile biggest_file not in v:\n\u3000biggest_file -= 1\nprint(cnt, biggest_file)\n"}, {'id': '3', 'text': 'Системный администратор раз в неделю создаёт архив пользовательских файлов. Однако объём диска, куда он помещает архив, может быть меньше, чем суммарный объём архивируемых файлов. Известно, какой объём занимает файл каждого пользователя.\nПо заданной информации об объёме файлов пользователей и свободном объёме на архивном диске определите максимальное число пользователей, чьи файлы можно сохранить в архиве, а также максимальный размер имеющегося файла, который может быть сохранён в архиве, при условии, что сохранены файлы максимально возможного числа пользователей.\nВ первой строке входного файла находятся два числа: S — размер свободного места на диске (натуральное число, не превышающее 10 000) и N — количество пользователей (натуральное число, не превышающее 5000). В следующих N строках находятся значения объёмов файлов каждого пользователя (все числа натуральные, не превышающие 100), каждое в отдельной строке.\nЗапишите в ответе два числа: сначала наибольшее число пользователей, чьи файлы могут быть помещены в архив, затем максимальный размер имеющегося файла, который может быть сохранён в архиве, при условии, что сохранены файлы максимально возможного числа пользователей. Запишите числа через пробел.', 'answer': '397 17', 'description': 'Решение задачи на языке Python.', 'python': "var \ni, j, t: integer;\na: array [1..5000] of integer;\ns: integer;\nn: integer;\nsum: integer;\nmaxi: integer;\nf: text;\nbegin\n    assign(f,'C:\\3.txt');\n    reset(f);\n    readln(f, s, n);\n    for i := 1 to n do readln(f, a[i]);\n    for i := 1 to n do\n        for j := i + 1 to n do \n            if a[i] > a[j] then begin\n                t := a[i];\n                a[i] := a[j];\n                a[j] := t;\n            end;\n    sum := 0;\n    maxi := 1;\n    for i := 1 to n do\n        if sum + a[i] <= s then begin\n            sum := sum + a[i];\n            maxi := i;\n        end;\n    t := a[maxi];\n    for i := maxi to n do\n        if ((sum - t) + a[i]) <= s then begin\n            sum := sum - t + a[i];\n            t := a[i];\n        end;\n    writeln(maxi, ' ', t);\nend."}]}
