{"tasks":[{"id":"1","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вниз  — в соседнюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой верхней клетки в правую нижнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1        8        8        4\n10        1        1        3\n1        3        12        2\n2        3        5        6\nДля указанных входных данных ответом должна быть пара чисел 41 и 22.","answer":"1322594","description":"Для поиска максимального значения будем работать с областью А13:J22, так как при расчетах будем использовать исходные значения монет в каждой клетке. В ячейку А13 напишем значение =A1. Для каждой ячейки левого столбца это будет сумма всех ячеек выше от текущей. Внесем в ячейку А14 формулу =A2+A13 и скопируем за маркер вниз до ячейки A22. Далее в ячейку B13 вставим формулу =B1+МАКС(A13;B12) и скопируем за маркер в ячейки B13:J22. Значение в ячейке J22 будет максимальной денежной суммой, которую сможет собрать Робот  — 1322.\nАналогичным образом найдём значение минимальной денежной суммы. Вместо функции МАКС в диапазоне ячеек B13:J22 напишем функцию МИН. В таком случае значение в ячейке J22 будет минимальной денежной суммой, которую сможет собрать Робот  — 594.\n"},{"id":"2","text":"Робот стоит в левом верхнем углу прямоугольного поля, в каждой клетке которого записано натуральное число. За один ход робот может переместиться на одну клетку вправо или на одну клетку вниз. Выходить за пределы поля робот не может. Некоторые клетки на поле окружены границами, в эти клетки роботу заходить нельзя.\nВ начальный момент запас энергии робота составляет 3000 единиц. Проходя через каждую клетку, робот расходует энергию, при этом расход равен числу, записанному в клетке. В клетках с выделенным фоном находятся зарядные станции. При прохождении через эти клетки робот не расходует, а пополняет запас энергии. Сумма пополнения равна числу, записанному в этой клетке.\nОпределите максимальный и минимальный запас энергии, который может быть у робота после перехода в правую нижнюю клетку поля. В ответе запишите два числа: сначала максимально возможное значение, затем  — минимальное.\nИсходные данные записаны в электронной таблице. Границы отмечены утолщёнными линиями.\n\nПример входных данных (для таблицы размером 4 × 4):\n13        8        69        50\n30        35        57        17\n32        90        55        32\n44        12        80        43\nПри указанных входных данных максимальное значение получается при движении по маршруту\n3000 − 13 − 8 + 35 − 57 − 17 − 32 − 43 = 2865,\nа минимальное  — при движении по маршруту\n3000 − 13 − 30 − 32 − 90 − 12 − 80 − 43 = 2700.","answer":"2093935","description":"Сначала найдём максимально возможный запас энергии. Поскольку робот не может заходить в ячейки, окружённые стенами, установим в ячейки E6, E11, K6, K11 значения 10000. В ячейках с зарядными станциями инвертируем положительные значения в отрицательные, чтобы при использовании вычитаний значения в зарядных станциях, наоборот, прибавлялись к запасу топлива.\nВ ячейку A17 запишем формулу =3000-A1. Для диапазонов B17:O17 и A18:A31, при переходе в очередную ячейку диапазона, из текущего запаса энергии будем вычитать значение этой ячейки. В ячейку B17 запишем формулу =A17-B1 и скопируем её во все ячейки диапазона C17:O17. В ячейку A18 запишем формулу =A17-A2 и скопируем её во все ячейки диапазона A18:A31. В ячейку B18 запишем формулу =МАКС(A18-B2;B17-B2) и скопируем её во все ячейки диапазона B18:O31. Таким образом, в ячейке O31 получим максимально возможное значение запаса энергии  — 2093.\nТеперь найдём минимально возможный запас энергии. Поскольку робот не может заходить в ячейки, окружённые стенами, установим в ячейки E6, E11, K6, K11 значения −10000. В ячейках с зарядными станциями инвертируем положительные значения в отрицательные, чтобы при использовании вычитаний значения в зарядных станциях, наоборот, прибавлялись к запасу топлива.\nВ ячейку A17 запишем формулу =3000-A1. Для диапазонов B17:O17 и A18:A31, при переходе в очередную ячейку диапазона, из текущего запаса энергии будем вычитать значение этой ячейки. В ячейку B17 запишем формулу =A17-B1 и скопируем её во все ячейки диапазона C17:O17. В ячейку A18 запишем формулу =A17-A2 и скопируем её во все ячейки диапазона A18:A31. В ячейку B18 запишем формулу =МИН(A18-B2;B17-B2) и скопируем её во все ячейки диапазона B18:O31. Таким образом, в ячейке O31 получим минимально возможное значение запаса энергии  — 935.\n"},{"id":"3","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вниз  — в соседнюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой верхней клетки в правую нижнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел 41 и 22.","answer":"1226529","description":"Для поиска максимального значения будем работать с областью А13:J22, так как при расчетах будем использовать исходные значения монет в каждой клетке. В ячейку А13 напишем значение =A1. Для каждой ячейки левого столбца это будет сумма всех ячеек выше от текущей. Внесем в ячейку А14 формулу =A2+A13 и скопируем за маркер вниз до ячейки A22. Далее в ячейку B13 вставим формулу =B1+МАКС(A13;B12) и скопируем за маркер в ячейки B13:J22. Значение в ячейке J22 будет максимальной денежной суммой, которую сможет собрать Робот  — 1226.\nАналогичным образом найдём значение минимальной денежной суммы. Вместо функции МАКС в диапазоне ячеек B13:J22 напишем функцию МИН. В таком случае значение в ячейке J22 будет минимальной денежной суммой, которую сможет собрать Робот  — 529.\n"},{"id":"4","text":"Дана последовательность вещественных чисел. Из неё необходимо выбрать несколько подряд идущих чисел так, чтобы каждое следующее число отличалось от предыдущего не более чем на 10. Какую максимальную сумму могут иметь выбранные числа?\nВ ответе запишите только целую часть максимально возможной суммы. Исходная последовательность записана в виде одного столбца электронной таблицы.\n\nПример входных данных:\n5,2\n13,1\n2,2\n12,3\n3,1\n2,3\nДля указанных входных данных ответом будет число 18.","answer":"80","description":"Скопируем число из ячейки A1 в ячейку B1. Заметим, что если будет получаться отрицательная сумма, то дальнейшее рассмотрение данной суммы последовательности чисел не имеет смысла, и необходимо начать рассмотрение новой последовательности. Например, имея последовательность чисел 1, −1, −6 и 1, 2 суммировав все числа, получим сумму −3, хотя если, просуммировав первые три числа и получив сумму −6, перейти к рассмотрению следующей последовательности чисел, можно получить сумму 3. Учитывая это, запишем в ячейку B2 формулу =ЕСЛИ(B1>0;ЕСЛИ(ABS(A2-A1)<=10;B1+A2;A2);A2) и скопируем её во все ячейки диапазона B3:B500. Теперь в ячейке C1 запишем формулу =МАКС(B1:B500), получив тем самым значение 80,76. Таким образом, ответ  — 80.\n"},{"id":"5","text":"Робот стоит в левом верхнем углу прямоугольного поля, в каждой клетке которого записано натуральное число. За один ход робот может переместиться на одну клетку вправо или на одну клетку вниз. Выходить за пределы поля робот не может. В начальный момент запас энергии робота равен числу, записанному в стартовой клетке. После каждого шага робота запас энергии изменяется по следующим правилам: если число в очередной клетке больше, чем в предыдущей, запас увеличивается на величину этого числа, если меньше  — уменьшается на эту же величину.\nОпределите максимальный и минимальный запас энергии, который может быть у робота после перехода в правую нижнюю клетку поля. В ответе запишите два числа: сначала максимально возможное значение, затем минимальное.\nИсходные данные записаны в электронной таблице.\n\nПример входных данных (для таблицы размером 4 × 4):\n200    8    69    50\n87    35    7    17\n32    1    9    32\n44    12    80    43\nПри указанных входных данных максимальное значение получается при движении по маршруту 200 − 8 + 69 − 7 + 17 + 32 + 43  =  346, а минимальное при движении по маршруту 200 − 87 − 35 − 7 + 9 + 80 − 43  =  117.","answer":"30811656","description":"Найдём максимально возможное значение. В ячейку A17 скопируем значение ячейки A1. Для диапазонов B17:O17 и A18:A31 будем просто сравнивать значение текущей ячейки и значение предыдущей ячейки. В ячейку B17 запишем формулу =ЕСЛИ(B1>A1;A17+B1;A17-B1) и скопируем её во все ячейки диапазона C17:O17. В ячейку A18 запишем формулу =ЕСЛИ(A2>A1;A17+A2;A17-A2) и скопируем её во все ячейки диапазона A19:A31. В ячейку B18 запишем формулу\n=МАКС(ЕСЛИ(B2>A2;A18+B2;A18-B2);ЕСЛИ(B2>B1;B17+B2;B17-B2))\nи скопируем её во все ячейки диапазона B18:O31. Таким образом, в ячейке O31 появится искомое значение максимально возможного запаса сил робота  — 3081.\nМинимально возможный запас энергии находится аналогичным образом. Ячейки диапазонов A17:O17 и A17:A31 будут принимать такие же значения, как и при поиске максимально возможного значения. В ячейку B18 запишем формулу\n=МИН(ЕСЛИ(B2>A2;A18+B2;A18-B2);ЕСЛИ(B2>B1;B17+B2;B17-B2))\nи скопируем её во все ячейки диапазона B18:O31. Таким образом, в ячейке O31 появится искомое значение минимально возможного запаса сил робота  — 1656.\n"},{"id":"6","text":"Дана последовательность вещественных чисел. Из неё необходимо выбрать несколько подряд идущих чисел так, чтобы каждое следующее число отличалось от предыдущего не более чем на 8. Какую максимальную сумму могут иметь выбранные числа?\nВ ответе запишите только целую часть максимально возможной суммы. Исходная последовательность записана в виде одного столбца электронной таблицы.\n\nПример входных данных:\n5,2\n13,1\n2,2\n11,3\n3,1\n2,3\nДля указанных входных данных ответом будет число 18.","answer":"69","description":"Скопируем число из ячейки A1 в ячейку B1. Заметим, что если будет получаться отрицательная сумма, то дальнейшее рассмотрение данной суммы последовательности чисел не имеет смысла, и необходимо начать рассмотрение новой последовательности. Например, имея последовательность чисел 1, −1, −6 и 1, 2 суммировав все числа, получим сумму −3, хотя если, просуммировав первые три числа и получив сумму −6, перейти к рассмотрению следующей последовательности чисел, можно получить сумму 3. Учитывая это, запишем в ячейку B2 формулу =ЕСЛИ(B1>0;ЕСЛИ(ABS(A2-A1)<=8;B1+A2;A2);A2) и скопируем её во все ячейки диапазона B3:B500. Теперь в ячейке C1 запишем формулу =МАКС(B1:B500), получив тем самым значение 69,96. Таким образом, ответ  — 69.\n"},{"id":"7","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вниз  — в соседнюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой верхней клетки в правую нижнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел 41 и 22.","answer":"1227588","description":"Для поиска максимального значения будем работать с областью А13:J22, так как при расчетах будем использовать исходные значения монет в каждой клетке. В ячейку А13 напишем значение =A1. Для каждой ячейки левого столбца это будет сумма всех ячеек выше от текущей. Внесем в ячейку А14 формулу =A2+A13 и скопируем за маркер вниз до ячейки A22. Далее в ячейку B13 вставим формулу =B1+МАКС(A13;B12) и скопируем за маркер в ячейки B13:J22. Значение в ячейке J22 будет максимальной денежной суммой, которую сможет собрать Робот  — 1227.\nАналогичным образом найдём значение минимальной денежной суммы. Вместо функции МАКС в диапазоне ячеек B13:J22 напишем функцию МИН. В таком случае значение в ячейке J22 будет минимальной денежной суммой, которую сможет собрать Робот  — 588.\n"},{"id":"8","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вниз  — в соседнюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой верхней клетки в правую нижнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел 41 и 22.","answer":"1360537","description":"Для поиска максимального значения будем работать с областью А13:J22, так как при расчетах будем использовать исходные значения монет в каждой клетке. В ячейку А13 напишем значение =A1. Для каждой ячейки левого столбца это будет сумма всех ячеек выше от текущей. Внесем в ячейку А14 формулу =A2+A13 и скопируем за маркер вниз до ячейки A22. Далее в ячейку B13 вставим формулу =B1+МАКС(A13;B12) и скопируем за маркер в ячейки B13:J22. Значение в ячейке J22 будет максимальной денежной суммой, которую сможет собрать Робот  — 1360.\nАналогичным образом найдём значение минимальной денежной суммы. Вместо функции МАКС в диапазоне ячеек B13:J22 напишем функцию МИН. В таком случае значение в ячейке J22 будет минимальной денежной суммой, которую сможет собрать Робот  — 537.\n"},{"id":"9","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вверх. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вверх  — в соседнюю верхнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой нижней клетки в правую верхнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел 35 и 15.","answer":"1114440","description":"Для поиска максимального значения будем работать с областью А13:J22, так как при расчетах будем использовать исходные значения монет в каждой клетке. В ячейку А22 напишем значение =A10. Для каждой ячейки левого столбца это будет сумма всех ячеек ниже от текущей. Внесем в ячейку А21 формулу =A9+A22 и скопируем за маркер вверх до ячейки A13. Далее в ячейку B22 вставим формулу =B10+МАКС(A22;B23) и скопируем за маркер в ячейки B13:J22. Значение в ячейке J13 будет максимальной денежной суммой, которую сможет собрать Робот  — 1114.\nАналогичным образом найдём значение минимальной денежной суммы. Вместо функции МАКС в диапазоне ячеек B13:J22 напишем функцию МИН. В таком случае значение в ячейке J13 будет минимальной денежной суммой, которую сможет собрать Робот  — 440.\n"},{"id":"10","text":"Квадрат разлинован на N × N клеток (1 < N < 26). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку; по команде вниз  — в соседнюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата указана плата за посещение в размере от 1 до 100. Посетив клетку, Робот платит за её посещение; это также относится к начальной и конечной клеткам маршрута Робота.\nОпределите минимальную и максимальную денежные суммы, которые заплатит Робот, пройдя из левой верхней клетки в правую нижнюю. В ответе укажите два числа: сначала минимальную сумму, затем максимальную, без разделительных знаков. Исходные данные представляют собой электронную таблицу размером N × N, каждая ячейка которой соответствует клетке квадрата.\nИсходные данные записаны в электронной таблице.\n\nПример входных данных (для таблицы размером 4 × 4):\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел: 22 и 41.","answer":"438669","description":"Сначала найдём максимальную денежную сумму. Для этого найдём максимальную денежную сумму для каждой ячейки таблицы. Для каждой ячейки верхней строки это будет сумма всех ячеек слева от текущей. Для каждой ячейки левого столбца это будет сумма всех ячеек сверху от текущей. В ячейку P1 запишем формулу =СУММ($A$1:A1). Скопируем эту формулу во все ячейки в диапазоне Q1:AD1 и в диапазоне P2:P15. Для остальных ячеек будем сравнивать значение ячейки слева и значение ячейки сверху и присваивать текущей ячейке значение суммы той ячейки, в которой значение больше, и текущей ячейки. В Q2 запишем формулу =ЕСЛИ(P2>Q1;P2+B2;Q1+B2) и скопируем эту формулу во все ячейки диапазона Q2:AD15. Таким образом, в ячейке AD15 получим значение максимальной денежной суммы  — 669.\nАналогичным образом найдём значение минимальной денежной суммы. Ячейки диапазонов P1:P15 и Q1:AD1 заполняются также, как при поиске максимальной денежной суммы. В Q2 запишем формулу =ЕСЛИ(P2<Q1;P2+B2;Q1+B2) и скопируем эту формулу во все ячейки диапазона Q2:AD15. Таким образом, в ячейке AD15 получим значение минимальной денежной суммы  — 438.\n"},{"id":"11","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вниз  — в соседнюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой верхней клетки в правую нижнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел 41 и 22.","answer":"1233604","description":"Для поиска максимального значения будем работать с областью А13:J22, так как при расчетах будем использовать исходные значения монет в каждой клетке. В ячейку А13 напишем значение =A1. Для каждой ячейки левого столбца это будет сумма всех ячеек выше от текущей. Внесем в ячейку А14 формулу =A2+A13 и скопируем за маркер вниз до ячейки A22. Далее в ячейку B13 вставим формулу =B1+МАКС(A13;B12) и скопируем за маркер в ячейки B13:J22. Значение в ячейке J22 будет максимальной денежной суммой, которую сможет собрать Робот  — 1233.\nАналогичным образом найдём значение минимальной денежной суммы. Вместо функции МАКС в диапазоне ячеек B13:J22 напишем функцию МИН. В таком случае значение в ячейке J22 будет минимальной денежной суммой, которую сможет собрать Робот  — 604.\n"},{"id":"12","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вниз  — в соседнюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой верхней клетки в правую нижнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел 41 и 22.","answer":"1496782","description":"Для поиска максимального значения будем работать с областью А13:J22, так как при расчетах будем использовать исходные значения монет в каждой клетке. В ячейку А13 напишем значение =A1. Для каждой ячейки левого столбца это будет сумма всех ячеек выше от текущей. Внесем в ячейку А14 формулу =A2+A13 и скопируем за маркер вниз до ячейки A22. Далее в ячейку B13 вставим формулу =B1+МАКС(A13;B12) и скопируем за маркер в ячейки B13:J22. Значение в ячейке J22 будет максимальной денежной суммой, которую сможет собрать Робот  — 1496.\nАналогичным образом найдём значение минимальной денежной суммы. Вместо функции МАКС в диапазоне ячеек B13:J22 напишем функцию МИН. В таком случае значение в ячейке J22 будет минимальной денежной суммой, которую сможет собрать Робот  — 782.\n"},{"id":"13","text":"Робот стоит в левом верхнем углу прямоугольного поля, в каждой клетке которого записано натуральное число. За один ход робот может переместиться на одну клетку вправо или на одну клетку вниз. Выходить за пределы поля робот не может. Между некоторыми клетками находятся стены, проходить сквозь стены робот не может.\nВ начальный момент запас энергии робота равен числу, записанному в стартовой клетке. При каждом шаге робот расходует энергию. При шаге вниз расход энергии равен числу, записанному в клетке, в которую переходит робот, при шаге вправо  — удвоенному числу, записанному в клетке, в которую переходит робот.\nОпределите максимальный и минимальный запас энергии, который может быть у робота после перехода в правую нижнюю клетку поля. В ответе запишите два числа: сначала максимально возможное значение, затем минимальное.\nИсходные данные записаны в электронной таблице. Стены отмечены утолщёнными линиями.\n\nПример входных данных (для таблицы размером 4 × 4):\n500    8    69    50\n30    35    57    17\n32    1    9    32\n44    12    80    43\nПри указанных входных данных максимальное значение получается при движении по маршруту\n500 − 2 · 8 − 35 − 2 · 57 − 2 · 17 − 32 − 43  =  226,\nа минимальное при движении по маршруту\n500 − 30 − 32 − 44 − 2 · 12 − 2 · 80 − 2 · 43  =  124.","answer":"1825236","description":"Сначала найдём максимально возможный запас энергии. В ячейку A17 скопируем значение ячейки A1. Для диапазона B17:O17, при переходе в очередную ячейку диапазона, из текущего запаса энергии будем вычитать удвоенное значение этой ячейки. В ячейку B17 запишем формулу =A17-2*B1 и скопируем её во все ячейки диапазона C17:O17. Для диапазона A18:A31, при переходе в очередную ячейку диапазона, из текущего запаса энергии будем вычитать значение этой ячейки. В ячейку A18 запишем формулу =A17-A2 и скопируем её во все ячейки диапазона A19:A31.\nДля ячеек диапазонов D24:D26, J20:J22 и L26:L28, поскольку слева от них имеются стены, запас энергии будет вычисляться аналогично диапазону A18:A31. В ячейку D24 запишем формулу =D23-D8 и скопируем её во все ячейки диапазонов D25:D26, J20:J22 и L26:L28. Для ячеек диапазонов D27:F27, J23:L23 и L29:N29, поскольку сверху от них имеются стены, запас энергии будет вычисляться аналогично диапазону B17:O17. В ячейку D27 запишем формулу =C27-2*D11 и скопируем её во все ячейки диапазонов E27:F27, J23:L23 и L29:N29.\nДля остальных ячеек будем сравнивать значение разности ячейки слева и удвоенного исходного значения текущей ячейки, значение разности ячейки сверху и исходного значения текущей ячейки, максимальное из сравниваемых значений будем записывать в текущую ячейку. В ячейку B18 запишем формулу\n=МАКС(A18-2*B2;B17-B2)\nи скопируем её во все ячейки диапазона B18:O31, за исключением ранее рассмотренных ячеек со стенками слева и сверху. В ячейке O31 получим максимальный запас энергии  — 1825.\nМинимально возможный запас энергии находится аналогичным образом. Ячейки диапазонов B17:O17 и A18:A31 будут принимать такие же значения, как и при поиске максимально возможного значения. Для ячеек диапазонов D24:D26, J20:J22 и L26:L28, поскольку слева от них имеются стены, запас энергии будет вычисляться аналогично диапазону A18:A31. В ячейку D24 запишем формулу =D23-D8 и скопируем её во все ячейки диапазонов D25:D26, J20:J22 и L26:L28. Для ячеек диапазонов D27:F27, J23:L23 и L29:N29, поскольку сверху от них имеются стены, запас энергии будет вычисляться аналогично диапазону B17:O17. В ячейку D27 запишем формулу =C27-2*D11 и скопируем её во все ячейки диапазонов E27:F27, J23:L23 и L29:N29.\nДля остальных ячеек будем сравнивать значение разности ячейки слева и удвоенного исходного значения текущей ячейки, значение разности ячейки сверху и исходного значения текущей ячейки, минимальное из сравниваемых значений будем записывать в текущую ячейку. В ячейку B18 запишем формулу\n=МИН(A18-2*B2;B17-B2)\nи скопируем её во все ячейки диапазона B18:O31, за исключением ранее рассмотренных ячеек со стенками слева и сверху. В ячейке O31 получим минимальный запас энергии  — 236.\n"},{"id":"14","text":"Дан квадрат 15 × 15 клеток, в каждой клетке которого записано целое число. В левом верхнем углу квадрата стоит ладья. За один ход ладья может переместиться в пределах квадрата на любое количество клеток вправо или вниз (влево и вверх ладья ходить не может). Необходимо переместить ладью в правый нижний угол так, чтобы сумма чисел в клетках, в которых ладья останавливалась (включая начальную и конечную), была максимальной. В ответе запишите максимально возможную сумму.\nИсходные данные записаны в электронной таблице.\n\nПример входных данных (для таблицы размером 4 × 4):\n−3    1    −3    −4\n−4    −4    −2    2\n6    1    2    −2\n−6    7    6    −3\nДля указанных входных данных ответом будет число 14 (ладья проходит через клетки с числами −3, 6, 1, 7, 6, −3).","answer":"323","description":"Скопируем число из ячейки A1 в ячейку P1. Поскольку ладья может ходить через неограниченное количество ячеек вниз и вправо, необходимо для каждой ячейки выбирать, из какого числа в строке до этой ячейки, и из какого числа в столбце выше этой ячейки должна сходить ладья, чтобы сумма ячеек при этом была максимальной. Для этого в ячейке Q1 запишем формулу =МАКС($P$1:P1)+B1 и скопируем её во все ячейки диапазона R1:AD1. В ячейке P2 запишем формулу =МАКС($P$1:P1)+A2 и скопируем её во все ячейки диапазона P3:P15. В ячейке Q2 запишем формулу =МАКС($P2:P2;Q$1:Q1)+B2 и скопируем её во все ячейки диапазона Q2:AD15. Получим ответ  — 323.\n"},{"id":"15","text":"Робот стоит в левом нижнем углу прямоугольного поля, в каждой клетке которого записано натуральное число. За один ход робот может переместиться на одну клетку вправо или на одну клетку вверх. Выходить за пределы поля робот не может. Некоторые клетки на поле окружены границами, в эти клетки роботу заходить нельзя.\nВ начальный момент запас энергии робота составляет 3000 единиц. Проходя через каждую клетку, робот расходует энергию, при этом расход равен числу, записанному в клетке. В клетках с выделенным фоном находятся зарядные станции. При прохождении через эти клетки робот не расходует, а пополняет запас энергии. Сумма пополнения равна числу, записанному в этой клетке.\nОпределите максимальный и минимальный запас энергии, который может быть у робота после перехода в правую верхнюю клетку поля. В ответе запишите два числа: сначала максимально возможное значение, затем  — минимальное.\nИсходные данные записаны в электронной таблице. Границы отмечены утолщёнными линиями.\n\nПример входных данных (для таблицы размером 4 × 4):\n13    8    69    50\n30    35    57    17\n32    90    55    32\n44    12    80    43\nПри указанных входных данных максимальное значение получается при движении по маршруту\n3000 − 44 − 12 + 90 − 55 − 32 − 17 − 50 = 2880,\nа минимальное  — при движении по маршруту\n3000 − 44 − 12 − 80 − 55 − 32 − 17 − 50 = 2710.","answer":"2201964","description":"Сначала найдём максимально возможный запас энергии. Поскольку робот не может заходить в ячейки, окружённые стенами, установим в ячейки E6, E11, K6, K11 значения 10000. В ячейках с зарядными станциями инвертируем положительные значения в отрицательные, чтобы при использовании вычитаний значения в зарядных станциях, наоборот, прибавлялись к запасу топлива.\nВ ячейку A31 запишем формулу =3000-A15. Для диапазонов B31:O31 и A17:A30, при переходе в очередную ячейку диапазона, из текущего запаса энергии будем вычитать значение этой ячейки. В ячейку B31 запишем формулу =A31-B15 и скопируем её во все ячейки диапазона C31:O31. В ячейку A30 запишем формулу =A31-A14 и скопируем её во все ячейки диапазона A17:A29. В ячейку B30 запишем формулу =МАКС(A30-B14;B31-B14) и скопируем её во все ячейки диапазона B17:O30. Таким образом, в ячейке O17 получим максимально возможное значение запаса энергии  — 2201.\nТеперь найдём минимально возможный запас энергии. Поскольку робот не может заходить в ячейки, окружённые стенами, установим в ячейки E6, E11, K6, K11 значения −10000. В ячейках с зарядными станциями инвертируем положительные значения в отрицательные, чтобы при использовании вычитаний значения в зарядных станциях, наоборот, прибавлялись к запасу топлива.\nВ ячейку A31 запишем формулу =3000-A15. Для диапазонов B31:O31 и A17:A30, при переходе в очередную ячейку диапазона, из текущего запаса энергии будем вычитать значение этой ячейки. В ячейку B31 запишем формулу =A31-B15 и скопируем её во все ячейки диапазона C31:O31. В ячейку A30 запишем формулу =A31-A14 и скопируем её во все ячейки диапазона A17:A29. В ячейку B30 запишем формулу =МИН(A30-B14;B31-B14) и скопируем её во все ячейки диапазона B17:O30. Таким образом, в ячейке O17 получим минимально возможное значение запаса энергии  — 964.\n"},{"id":"16","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вверх. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вверх  — в соседнюю верхнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой нижней клетки в правую верхнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел 35 и 15.","answer":"1181604","description":"Для поиска максимального значения будем работать с областью А13:J22, так как при расчетах будем использовать исходные значения монет в каждой клетке. В ячейку А22 напишем значение =A10. Для каждой ячейки левого столбца это будет сумма всех ячеек ниже от текущей. Внесем в ячейку А21 формулу =A9+A22 и скопируем за маркер вверх до ячейки A13. Далее в ячейку B22 вставим формулу =B10+МАКС(A22;B23) и скопируем за маркер в ячейки B13:J22. Значение в ячейке J13 будет максимальной денежной суммой, которую сможет собрать Робот  — 1181.\nАналогичным образом найдём значение минимальной денежной суммы. Вместо функции МАКС в диапазоне ячеек B13:J22 напишем функцию МИН. В таком случае значение в ячейке J13 будет минимальной денежной суммой, которую сможет собрать Робот  — 604.\n"},{"id":"17","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вниз  — в соседнюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой верхней клетки в правую нижнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел 41 и 22.","answer":"1204502","description":"Сначала найдём максимальную денежную сумму. Для этого найдём максимальную денежную сумму для каждой ячейки таблицы. Для каждой ячейки верхней строки это будет сумма всех ячеек слева от текущей. Для каждой ячейки левого столбца это будет сумма всех ячеек сверху от текущей. В ячейку L1 запишем формулу =СУММ($A$1:A1). Скопируем эту формулу во все ячейки в диапазоне M1:U1 и в диапазоне L2:L10. Для остальных ячеек будем сравнивать значение ячейки слева и значение ячейки сверху и присваивать текущей ячейке значение суммы той ячейки, в которой значение больше, и текущей ячейки. В M2 запишем формулу =ЕСЛИ(L2>M1;L2+B2;M1+B2) и скопируем эту формулу во все ячейки диапазона M2:U10. Таким образом, в ячейке U10 получим значение максимальной денежной суммы  — 1204.\nАналогичным образом найдём значение минимальной денежной суммы. Ячейки диапазонов L1:L10 и M1:U1 заполняются также, как при поиске максимальной денежной суммы. В M2 запишем формулу =ЕСЛИ(L2 < M1;L2+B2;M1+B2) и скопируем эту формулу во все ячейки диапазона M2:U10. Таким образом, в ячейке U10 получим значение минимальной денежной суммы  — 502.\n"},{"id":"18","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вниз  — в соседнюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой верхней клетки в правую нижнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел 41 и 22.","answer":"1044448","description":"Для поиска максимального значения будем работать с областью А13:J22, так как при расчетах будем использовать исходные значения монет в каждой клетке. В ячейку А13 напишем значение =A1. Для каждой ячейки левого столбца это будет сумма всех ячеек выше от текущей. Внесем в ячейку А14 формулу =A2+A13 и скопируем за маркер вниз до ячейки A22. Далее в ячейку B13 вставим формулу =B1+МАКС(A13;B12) и скопируем за маркер в ячейки B13:J22. Значение в ячейке J22 будет максимальной денежной суммой, которую сможет собрать Робот  — 1044.\nАналогичным образом найдём значение минимальной денежной суммы. Вместо функции МАКС в диапазоне ячеек B13:J22 напишем функцию МИН. В таком случае значение в ячейке J22 будет минимальной денежной суммой, которую сможет собрать Робот  — 448.\n"},{"id":"19","text":"Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вверх. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вверх  — в соседнюю верхнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клетку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршрута Робота.\n\nОткройте файл. Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой нижней клетки в правую верхнюю. В ответ запишите два числа друг за другом без разделительных знаков  — сначала максимальную сумму, затем минимальную.\nИсходные данные представляют собой электронную таблицу размером N×N, каждая ячейка которой соответствует клетке квадрата.\nПример входных данных:\n1    8    8    4\n10    1    1    3\n1    3    12    2\n2    3    5    6\nДля указанных входных данных ответом должна быть пара чисел 35 и 15.","answer":"1439681","description":"Для поиска максимального значения будем работать с областью А13:J22, так как при расчетах будем использовать исходные значения монет в каждой клетке. В ячейку А22 напишем значение =A10. Для каждой ячейки левого столбца это будет сумма всех ячеек ниже от текущей. Внесем в ячейку А21 формулу =A9+A22 и скопируем за маркер вверх до ячейки A13. Далее в ячейку B22 вставим формулу =B10+МАКС(A22;B23) и скопируем за маркер в ячейки B13:J22. Значение в ячейке J13 будет максимальной денежной суммой, которую сможет собрать Робот  — 1439.\nАналогичным образом найдём значение минимальной денежной суммы. Вместо функции МАКС в диапазоне ячеек B13:J22 напишем функцию МИН. В таком случае значение в ячейке J13 будет минимальной денежной суммой, которую сможет собрать Робот  — 681.\n"},{"id":"20","text":"Дан квадрат 15×15 клеток, в каждой клетке которого записано целое число. В левом верхнем углу квадрата стоит робот. За один ход робот может переместиться на одну клетку вправо или на одну клетку вниз. Выходить за пределы квадрата робот не может. При этом ведётся подсчёт суммы по следующим правилам: число в очередной клетке, через которую проходит робот, включается в сумму, если оно больше числа в предыдущей клетке на пути робота. Если число в очередной клетке не больше числа в предыдущей, сумма не изменяется. Число в начальной клетке всегда включается в сумму. Необходимо переместить робота в правый нижний угол так, чтобы полученная сумма была максимальной. В ответе запишите максимально возможную сумму.\nИсходные данные записаны в электронной таблице.\n\nПример входных данных (для таблицы размером 4 × 4):\n44    42    89    37\n18    35    50    20\n6    41    26    64\n7    9    70    85\nДля указанных входных данных оптимальным маршрутом будет путь по клеткам 44, 42, 89, 50, 26, 70, 85. Итоговая сумма равна 44 + 89 + 70 + 85  =  288. Числа 42, 50 и 26 не включаются в сумму, так как 42 < 44, 50 < 89 и 26 < 50.","answer":"1296","description":"Найдём максимальную сумму. Для этого найдём максимальную сумму для каждой ячейки таблицы. В ячейку P1 скопируем значение ячейки A1. В ячейку Q1 запишем формулу =ЕСЛИ(B1>A1;B1+P1;P1). Скопируем эту формулу во все ячейки в диапазоне R1:AD1. В ячейку P2 запишем формулу =ЕСЛИ(A2>A1;A2+P1;P1). Скопируем эту формулу во все ячейки в диапазоне P3:P15. В ячейке Q2 запишем формулу\n=МАКС(ЕСЛИ(B2>A2;B2+P2;P2);ЕСЛИ(B2>B1;B2+Q1;Q1))\nи скопируем эту формулу во все ячейки диапазона Q2:AD15. Таким образом, в ячейке AD15 получим значение максимальной суммы  — 1296."}]}