{'tasks': [{'id': '1', 'text': 'Ниже записан алгоритм. Получив на вход число x, этот алгоритм печатает два числа: a и b. Укажите наименьшее из таких чисел x, при вводе которого алгоритм печатает сначала 3, а потом 2.', 'program': 'x = int(input())\na = 0\nb = 0\nwhile x > 0:\n    a += 1\n    if (b < (x % 8)):\n        b =x % 8\n    x //=  8\nprint(a)\nprint(b)', 'answer': '66', 'description': 'Значение в переменной a после выполнения цикла равно количеству выполненных циклов. Поскольку требуется, чтобы программа напечатала сначала число 3, цикл должен выполниться три раза. Оператор div оставляет только целую часть от деления, следовательно, искомое число должно два раза делиться на 8 так, чтобы целая часть результата была положительной. Следовательно, это число должно быть не меньше числа 64.\nВ переменную b записывается остаток от деления числа на 8. По условию требуется, чтобы после выполнения цикла переменная b имела значение 2, т. е. максимальный остаток от деления на 8 в цикле должен быть равен 2.\nВыполним программу для всех чисел, не меньших чем 64. Первое число, которое удовлетворит условию и будет наименьшим. Поскольку программа выводит целые числа и никаких других операторов к числу, кроме операторов div и mod, не применяется, будем рассматривать только целые числа.\nПри вводе числа 64 программа выведет числа 3 и 1. При вводе числа 65 программа выведет числа 3 и 1. При вводе числа 66 программа выведет числа 3 и 2. Следовательно, ответ 66.', 'python': 'нет\n'}, {'id': '2', 'text': 'Ниже записан алгоритм. Получив на вход число x, этот алгоритм печатает два числа a и b. Укажите наименьшее из таких чисел x, при вводе которого алгоритм печатает сначала 2, а потом 7.', 'program': 'x = int(input())\na, b = 0, 1\nwhile x > 0:\n    a = a + 1\n    b = b * (x%100)\n    x = x//100\nprint(a)\nprint(b)', 'answer': '107', 'description': 'Рассмотрим цикл, число шагов которого зависит от изменения переменной x. Т. к. оператор // возвращает целую часть от деления, то при делении на 100 это равносильно отсечению последних двух цифр.\nНа каждом шаге от десятичной записи x отсекается две последних цифры до тех пор, пока все цифры не будут отсечены, то есть x не станет равно 0. Для того, чтобы a стало равным 2, x должно быть трёхзначным или четырёхзначным.\nТеперь рассмотрим изменение b. Оператор % возвращает остаток от деления, при делении на 100 это последние две цифры x. Следовательно, число b является произведением остатков от деления числа x на 100. Представим число 7 в виде 1 * 7, представления в виде произведения других множителей не существует. Чтобы число x было наименьшим, оно должно начинаться с 1, значит, остаток от деления на 100 должен быть равен 7, следовательно, число должно оканчиваться на 07. Искомое число — 107.', 'python': 'нет\n'}, {'id': '3', 'text': 'Ниже записан алгоритм. Получив на вход число x, этот алгоритм печатает числа: a и b. Укажите наименьшее положительное пятизначное число x, при котором после выполнения алгоритма будет напечатано сначала 4, а потом 2.', 'program': 'a = 0\nb = 0\nx = int(input())\nwhile x > 0:\n    y = x % 10\n    if y > 3:\n        a = a+1\n    if y < 8:\n        b = b+1\n    x = x // 10\nprint(a)\nprint(b)', 'answer': '14888', 'description': 'Число a — количество цифр в числе, больших 3.\nЧисло b — количество цифр в числе, меньших 8.\nТаким образом, получается 1 цифра меньше 4, цифра от 4 до 7 и 3 цифры больше 7. Подбирая для каждой из цифр минимальное значение и отсортировав эти цифры в порядке возрастания, получим минимальное число 14888.', 'python': 'нет'}]}
