{"tasks":[{"id":"1","text":"В велокроссе участвуют 96 спортсменов. Специальное устройство регистрирует прохождение каждым из участников промежуточного финиша, записывая его номер с использованием минимально возможного количества бит, одинакового для каждого спортсмена. Какой объём памяти будет использован устройством, когда промежуточный финиш прошли 90 велосипедистов? (Ответ дайте в битах.)","answer":"630","description":"Известно, что с помощью N бит можно закодировать 2^N различных чисел. Поскольку 2^6 < 96 < 2^7 и для каждого спортсмена число бит одинаково, то для записи каждого из 96 номеров необходимо 7 бит памяти. Поэтому сообщение о 90 номерах имеет объем 90 · 7 = 630 бит.\n"},{"id":"2","text":"При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 11 символов и содержащий только символы А, Б, В, Г, Д, Е. Каждый такой пароль в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт, при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит. Определите, сколько байт необходимо для хранения 20 паролей.","answer":"100","description":"Согласно условию, в пароле могут быть использованы 6 символов. Известно, что с помощью N бит можно закодировать 2^N различных вариантов. Поскольку 2^2 < 6 < 2^3, то для записи каждого из 6 символов необходимо 3 бита.\nДля хранения всех 11 символов пароля нужно 3 · 11 = 33 бита, а т. к. для записи используется целое число байт, то берём ближайшее не меньшее значение, кратное восьми, это число 40 = 5 · 8 бит = 5 байт.\nТогда для записи двадцати паролей необходимо 5 · 20 = 100 байт.\n"},{"id":"3","text":"При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 15 символов и содержащий только символы из 12-символьного набора: А, В, C, D, Е, F, G, H, K, L, M, N. В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт. При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит. Кроме собственно пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего выделено целое число байт; это число одно и то же для всех пользователей. Для хранения сведений о 20 пользователях потребовалось 400 байт. Сколько байт выделено для хранения дополнительных сведений об одном пользователе? В ответе запишите только целое число – количество байт.","answer":"12","description":"Согласно условию, в номере могут быть использованы 12 букв. Известно, что с помощью N бит можно закодировать 2^N различных вариантов. Поскольку 2^3 < 12 < 2^4, то для записи каждого из 12 символов необходимо 4 бита.\nДля хранения всех 15 символов пароля нужно 4 · 15 = 60 бит, а т. к. для записи используется целое число байт, то берём ближайшее не меньшее значение, кратное восьми, это число 64 = 8 · 8 бит (8 байт).\nПусть количество памяти, отведенное под дополнительные сведения равно x, тогда:\n20 * (8+x) = 400,\nx = 12.\n"},{"id":"4","text":"B некоторой стране автомобильный номер длиной 8 символов составляют из заглавных букв (задействовано 20 различных букв) и десятичных цифр в любом порядке. Каждый такой номер в компьютерной программе записывается минимально возможным и одинаковым целым количеством байтов (при этом используют посимвольное кодирование и вcе СИМВОЛЫ кодируются одинаковым и минимально возможным количеством битов). Определите объём памяти, отводимый этой программой для записи 40 номеров. (Ответ дайте в байтах.)","answer":"200","description":"Согласно условию, в номере могут быть использованы 10 цифр (0..9) и 20 букв, всего 10 + 20 = 30 символов. Известно, что с помощью N бит можно закодировать 2^N различных вариантов. Поскольку 2^4 < 30 < 2^5, то для записи каждого из 30 символов необходимо 5 бит. Для хранения всех 8 символов номера нужно 8 * 5 = 40 бит или 5 байт. Тогда 40 номеров занимают 5 * 40 = 200 байт.\n"},{"id":"5","text":"При регистрации на сервере каждый пользователь получает уникальный персональный код, состоящий из 17 символов, каждый из которых может быть одной из 26 заглавных латинских букв. При этом в базе данных сервера формируется запись, содержащая этот код и дополнительную информацию о пользователе. Для представления кода используют посимвольное кодирование, все символы кодируют одинаковым минимально возможным количеством бит, а для кода в целом выделяется минимально возможное целое количество байт. Для хранения данных о 30 пользователях потребовалось 1200 байт. Сколько байт выделено для хранения дополнительной информации об одном пользователе? В ответе запишите только целое число  — количество байт.","answer":"29","description":"Согласно условию, в персональном коде могут быть использованы 26 символов. Известно, что с помощью N бит можно закодировать 2N различных вариантов. Поскольку 25  =  32, то для записи каждого из 17 символов необходимо 5 бит.\nДля хранения всех 17 символов личного кода нужно 5 · 17  =  85 бит. Минимально возможное количество байт, вмещающее в себя 85 бит  — 11.\nНа каждого пользователя отведено 1200 / 30  =  40 байт.\nЗначит, для хранения дополнительной информации об одном пользователе выделено 40 − 11  =  29 байт.\n"},{"id":"6","text":"При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 9 символов и содержащий только символы А, В, И, П, Р, Ф, Э, Ю, Я (таким образом, используется 9 различных символов). Каждый такой пароль в компьютерной системе записывается минимально возможным и одинаковым целым количеством байт (при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит). Укажите объём памяти в байтах, отводимый этой системой для записи 12 паролей. В ответе запишите только число, слово «байт» писать не нужно.","answer":"60","description":"Для кодирования символа из девятисимвольного алфавита требуется 4 бита (2 в кубе меньше 9 меньше или равно 2 в степени 4 ). Тогда для кодирования пароля из девяти символов требуется 4 умножить на 9 = 36 бит. Минимальное количество байт, содержащее в себе 36 бит − 5. Тогда для кодирования 12 паролей необходимо 5 умножить на 12 = 60 байт.\n"},{"id":"7","text":"При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 6 символов и содержащий только символы из 7-буквенного набора Н, О, Р, С, Т, У, X. В базе данных для хранения сведений о каждом пользователе отведено одинаковое целое число байт, при этом для хранения сведений о 100 пользователях используется 1400 байт. Для каждого пользователя хранятся пароль и дополнительные сведения. Для хранения паролей используют посимвольное кодирование, все символы кодируются одинаковым и минимально возможным количеством бит. Сколько бит отведено для хранения дополнительных сведений о каждом пользователе?","answer":"94","description":"Для хранения сведений об одном пользователе используется 1400/100 =14  байт = 112 бит.\nСогласно условию, в пароле могут быть использованы 7 букв. Известно, что с помощью N бит можно закодировать 2N различных вариантов. Поскольку 22 < 7 < 23, то для записи каждой из 7 букв необходимо 3 бит. Для записи шести букв необходимо 3 · 6 = 18 бит.\nТогда для хранения дополнительных сведений используется 112 − 18 = 94 бит.\n"},{"id":"8","text":"При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 30 символов и содержащий только символы А, Б, В, Г, Д. Каждый такой пароль в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт, при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит.\nОпределите, сколько байт необходимо для хранения 50 паролей.","answer":"600","description":"Каждый символ из 5-символьного алфавита кодируется с помощью 3 бит (2 в квадрате меньше 5 меньше или равно 2 в кубе ).\nТак как пароль содержит 30 символов, то всего требуется 3 умножить на 30 = 90 бит.\nМинимальное количество байт, которое содержит в себе 90 бит  — 12. То есть на каждый пароль требуется 12 байт.\nТогда для хранения 50 паролей необходимо 12 умножить на 50 = 600 байт.\n"},{"id":"9","text":"Каждый объект, зарегистрированный в информационной системе, получает уникальный код из 11 символов, каждый из которых может быть одной из 10 первых латинских букв (A, B, C, D, E, F, G, H, I, J). Для представления кода используют посимвольное кодирование, все символы кодируют одинаковым минимально возможным количеством битов, а для кода в целом выделяется минимально возможное целое количество байтов. Кроме того, для каждого объекта в системе выделен одинаковый объём памяти для хранения содержательной информации.\nДля хранения данных (код и содержательная информация) о 28 объектах потребовалось 700 байт. Сколько байтов выделено для хранения содержательной информации об одном объекте? В ответе запишите только целое число  — количество байтов.","answer":"19","description":"Заметим, что k бит позволяют кодировать 2k символов, поэтому для кодирования 10-символьного алфавита требуется 4 бит (ведь 2 в степени 4 = 16). Для хранения 11 символов требуется 11 умножить на 4 = 44 бит. Минимальное количество байт, вмещающее в себя 44 бит  =  6 байт (48 бит).\nПоскольку для хранения данных (код и содержательная информация) о 28 объектах потребовалось 700 байт, для хранения данных об одном пользователе потребуется 700 : 28  =  25 байт. Для хранения содержательной информации об одном пользователе используется 25 − 6  =  19 байт.\n"},{"id":"10","text":"При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 15 символов и содержащий только символы И, Н, Ф, О, Р, М, А, Т, К. Каждый такой пароль в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт (при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит). Определите объём памяти, отводимый этой программой для записи 25 паролей. (Ответ дайте в байтах.)","answer":" 200","description":"Согласно условию, в номере могут быть использованы 9 символов. Известно, что с помощью N бит можно закодировать 2N различных вариантов. Поскольку 23 < 9 < 24, то для записи каждого из 15 символов необходимо 4 бита.\nДля хранения всех 15 символов номера нужно 4 · 15  =  60 бит, а т. к. для записи используется целое число байт, то берём ближайшее не меньшее значение, кратное восьми, это число 64  =  8 · 8 бит (8 байт).\nТогда для записи 25 паролей необходимо 8 · 25  =  200 байт.\n"},{"id":"11","text":"\"Каждый сотрудник предприятия получает электронный пропуск, на котором записаны личный код сотрудника, код подразделения и некоторая дополнительная информация. Личный код состоит из 17 символов, каждый из которых может быть одной из 12 допустимых заглавных букв или одной из 8 цифр (цифры 0 и 3 не используются). Для записи кода на пропуске отведено минимально возможное целое число байтов. При этом используют посимвольное кодирование, все символы кодируют одинаковым минимально возможным количеством битов.\nКод подразделения  — натуральное число, не превышающее 1000, он записан на пропуске как двоичное число и занимает минимально возможное целое число байтов. Всего на пропуске хранится 36 байт данных. Сколько байтов выделено для хранения дополнительных сведений об одном сотруднике? В ответе запишите только целое число  — количество байтов.\"","answer":"23","description":"Согласно условию, в личном коде могут быть использованы 20 символов. Известно, что с помощью N бит можно закодировать 2N различных вариантов. Поскольку 25  =  32, то для записи каждого из 17 символов необходимо 5 бит.\nДля хранения всех 17 символов личного нужно 5 · 17  =  85 бит. Минимально возможное количество байт, вмещающее в себя 85 бит  — 11.\nНомер подразделения можно закодировать 2 байтами, поскольку в 1 байт помещаются число от 0 до 255.\nДля хранения данных об одном сотруднике требуется 36 байт данных. Из них 11 байт отводится на хранение личного кода, ещё 2 байта требуется для хранения номера подразделения. Следовательно, для хранения дополнительных сведений о сотруднике отводится 23 байта.\n"},{"id":"12","text":"При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 11 символов и содержащий только символы А, Б, В, Е, Ж, М, Н, Р, У, Я (таким образом, используется 10 различных символов). Каждый такой пароль в компьютерной системе записывается минимально возможным и одинаковым целым количеством байт (при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит). Укажите объём памяти в байтах, отводимый этой системой для записи 70 паролей.\nВ ответе запишите только число, слово «байт» писать не нужно.","answer":"420","description":"Для кодирования одного символа из десятисимвольного алфавита требуется 4 бита (2 в кубе меньше 10 меньше или равно 2 в степени 4 ).\nТогда для кодирования пароля из 11 символов требуется 4 умножить на 11 = 44 бита. Минимальное количество байт, содержащее в себе 44 бита  — 6.\nТогда для кодирования 70 паролей нужно 6 умножить на 70 = 420 байт.\n"},{"id":"13","text":"Каждый объект, зарегистрированный в информационной системе, получает уникальный код из 9 символов, каждый из которых может быть одной из 26 заглавных или строчных латинских букв. Для представления кода используют посимвольное кодирование, все символы кодируют одинаковым минимально возможным количеством битов, а для кода в целом выделяется минимально возможное целое количество байтов. Кроме того, для каждого объекта в системе выделен одинаковый объём памяти для хранения содержательной информации. Для хранения данных (код и содержательная информация) о 50 объектах потребовалось 2500 байт.\nСколько байтов выделено для хранения содержательной информации об одном объекте? В ответе запишите только целое число  — количество байтов.","answer":"43","description":"Заметим, что k бит позволяют кодировать 2k символов, поэтому для кодирования 52-символьного алфавита требуется 6 бит (ведь 2 в степени 6 = 64). Для хранения 9 символов требуется 9 умножить на 6 = 54 бит. Минимальное количество байт, вмещающее в себя 54 бита  =  7 байт (56 бит).\nПоскольку для хранения данных (код и содержательная информация) о 50 объектах потребовалось 2500 байт, для хранения данных об одном пользователе потребуется 2500 : 50  =  50 байт. Для хранения содержательной информации об одном пользователе используется 50 − 7  =  43 байта.\n"},{"id":"14","text":"При регистрации в компьютерной системе каждому пользователю выдается пароль, состоящий из 15 символов и содержащий только символы Е, Г, Э, 2, 0, 1, 3. Каждый такой пароль в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт (при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит).\nОпределите объем памяти, отводимый этой программой для записи 25 паролей. (Ответ дайте в байтах.)","answer":"150","description":"Согласно условию, в номере могут быть использованы 7 символов. Известно, что с помощью N бит можно закодировать 2N различных вариантов. Поскольку 22 < 7 < 23, то для записи каждого из 7 символов необходимо 3 бита.\nДля хранения всех 15 символов номера нужно 3*15 = 45 бит, а т. к. для записи используется целое число байт, то берём ближайшее не меньшее значение, кратное восьми, это число 48 = 6*8 бит (6 байт).\nТогда 25 паролей занимают 6*25 = 150 байт.\n"},{"id":"15","text":"Каждый объект, зарегистрированный в информационной системе, получает уникальный код из трёх частей. Первая часть кода определяет категорию объекта. Всего выделяется 6 категорий, которые обозначаются латинскими буквами A, B, C, D, E, F. Вторая часть кода описывает группу, к которой принадлежит объект. Эта часть состоит из 11 символов, каждый из которых может быть любой из 20 заглавных латинских букв (буквы, задающие категории, не используются). Третья часть кода задаёт порядковый номер объекта внутри категории и может быть целым числом от 1 до 1999. Каждая из трёх частей кодируется независимо. Для представления категории и группы используют посимвольное кодирование, все символы в пределах каждой части кода кодируют одинаковым минимально возможным количеством битов. Порядковый номер кодируется как двоичное целое число с использованием минимально возможного количества битов. Для кода в целом выделяется минимально возможное целое количество байтов. Кроме того, для каждого объекта выделен одинаковый объём памяти для хранения дополнительных регистрационных данных.\nДля хранения кода и дополнительных регистрационных данных 36 объектов потребовалось 1188 байт. Сколько байтов выделено для хранения дополнительных регистрационных данных одного объекта? В ответе запишите только целое число  — количество байтов.","answer":"24","description":"Заметим, что k бит позволяют кодировать 2k символов.\nДля кодирования первой части кода, использующей 6-символьный алфавит, требуется 3 бит (ведь 2 в кубе = 8). Для кодирования второй части кода, использующей 20-символьный алфавит, требуется 5 бит (ведь 2 в степени 5 = 32). Для хранения 11 символов требуется 11 умножить на 5 = 55 бит. Для хранения числа от 1 до 1999 в двоичном виде требуется 11 бит. Минимальное количество байт, вмещающее в себя 3 + 55 + 11 бит  =  69 бит потребуется 9 байт (72 бит).\nПоскольку для хранения данных (код и дополнительные данные) о 36 объектах потребовалось 1188 байт, для хранения данных об одном пользователе потребуется 1188 : 36  =  33 байта. Для хранения дополнительных данных об одном пользователе используется 33 − 9  =  24 байт.\n"},{"id":"16","text":"При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 14 символов и содержащий только символы Е, Г, Э, 2, 0, 1, 4. Каждый такой пароль в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт (при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит).\nОпределите объём памяти, отводимый этой программой для записи 30 паролей. (Ответ дайте в байтах.)","answer":"180","description":"Согласно условию, в номере могут быть использованы 7 символов. Известно, что с помощью N бит можно закодировать 2N различных вариантов. Поскольку 22 < 7 < 23, то для записи каждого из 7 символов необходимо 3 бита.\nДля хранения всех 14 символов номера нужно 3 · 14  =  42 бита, а т. к. для записи используется целое число байт, то берём ближайшее не меньшее значение, кратное восьми, это число 48  =  6 · 8 бит (6 байт).\nТогда для записи тридцати паролей необходимо 6 · 30  =  180 байт.\n"},{"id":"17","text":"При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 15 символов и содержащий только символы из 62-символьного набора, содержащего все латинские буквы (заглавные и строчные) и десятичные цифры. В базе данных для хранения сведений о каждом пользователе отведено одинаковое минимально возможное целое число байт. При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым минимально возможным количеством бит. Кроме, собственно, пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего выделено целое число байт; одно и то же для всех пользователей.\nДля хранения сведений о 20 пользователях потребовалось 700 байт. Сколько байт выделено для хранения дополнительных сведений об одном пользователе? В ответе запишите только целое число – количество байт.","answer":"23","description":"Согласно условию, в номере могут быть использованы 62 символов. Известно, что с помощью N бит можно закодировать 2 в степени левая круглая скобка N правая круглая скобка  различных вариантов. Так как 64=2^6, то для записи каждого из 62 символов необходимо 6 бит.\nВсего 15 символов, значит, пароль занимает 15*6=90 бит. Ближайшее число байт, покрывающее это число бит  — 12. Пусть количество памяти, отведенное под дополнительные сведения равно x, тогда:\n20 · (x+12)=700\nx + 12 = 35\nx = 23.\n"},{"id":"18","text":"При регистрации в компьютерной системе каждому пользователю выдаётся идентификатор, состоящий из 10 символов, первый и последний из которых  — одна из 18 букв, а остальные  — цифры (допускается использование 10 десятичных цифр). Каждый такой идентификатор в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт (при этом используют посимвольное кодирование; все цифры кодируются одинаковым и минимально возможным количеством бит, все буквы также кодируются одинаковым и минимально возможным количеством бит).\nОпределите объём памяти, отводимый этой программой для записи 25 идентификаторов. (Ответ дайте в байтах.)","answer":"150","description":"Рассмотрим отдельно буквенную и цифровую часть идентификатора.\nСогласно условию, в идентификаторе могут быть использованы 18 букв. Известно, что с помощью N бит можно закодировать 2N различных вариантов. Поскольку 24 < 18 < 25, то для записи каждой из 18 букв необходимо 5 бит.\nАналогично для цифр 23 < 10 < 24 для записи каждой из 10 цифр необходимо 4 бита.\nДля хранения всех 10 символов идентификатора нужно 5·2 + 4·8 = 42 бита, а т. к. для записи используется целое число байт, то берём ближайшее не меньшее значение, кратное восьми: это число 48 = 6·8 бит (6 байт).\nТогда 25 идентификаторов занимают 6·25 = 150 байт.\n"},{"id":"19","text":"Каждый сотрудник предприятия получает электронный пропуск, на котором записаны личный код сотрудника, код подразделения и некоторая дополнительная информация. Личный код состоит из 18 букв. Для формирования кодов используется 15 различных букв, каждая из которых может быть заглавной или строчной. Для записи кода на пропуске отведено минимально возможное целое число байт. При этом используют посимвольное кодирование, все символы кодируют одинаковым минимально возможным количеством бит. Код подразделения  — целое трёхзначное число, он записан на пропуске как двоичное число и занимает минимально возможное целое число байт. Всего на пропуске хранится 30 байт данных. Сколько байт выделено для хранения дополнительных сведений об одном сотруднике? В ответе запишите только целое число  — количество байт.","answer":"16","description":"k бит позволяют кодировать 2k символов, поэтому для кодирования 30-символьного алфавита требуется 5 бит (ведь 2 в степени 5 = 32 больше или равно 30 правая круглая скобка . Для хранения 18 символов требуется 18 умножить на 5 = 90 бит. Минимальное количество байт, вмещающее в себя 90 бит  — 12 байт (96 бит).\nКод подразделения можно закодировать 2 байтами, поскольку в 1 байт помещаются только числа от 0 до 255, а в 2 байта  — числа от 0 до 216 − 1, то есть для записи любого трехзначного числа достаточно двух байтов.\nДля хранения данных об одном сотруднике требуется 30 байт данных. Из них 12 байт отводится на хранение личного кода, ещё 2 байта требуется для хранения номера подразделения. Следовательно, для хранения дополнительных сведений о сотруднике отводится 16 байт.\n"},{"id":"20","text":"При регистрации в компьютерной системе каждому объекту присваивается идентификатор, состоящий из 250 символов и содержащий только десятичные цифры и символы из 1650-символьного специального алфавита. В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное целое число байт. При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально возможным количеством бит.\nОпределите объём памяти (в Кбайт), необходимый для хранения 65 536 идентификаторов. В ответе запишите только целое число  — количество Кбайт.","answer":"22016","description":"Согласно условию, в идентификаторе могут быть использованы 1660 символов. Известно, что с помощью N бит можно закодировать 2N различных вариантов. Поскольку 211 = 2048, то для записи каждого из 250 символов необходимо 11 бит.\nДля хранения всех 250 символов пароля нужно 11 · 250 = 2750 бит, а т. к. для записи используется целое число байт, то берём ближайшее не меньшее значение, кратное восьми, это число 344 = 344 · 8 бит (344 байт).\nТаким образом, для хранения 65 536 идентификаторов необходимо 65 536 · 344 / 1024  =  22016 Кбайт."}]}