{"tasks": [{"id": "1", "text": "В велокроссе участвуют 96 спортсменов. Специальное устройство регистрирует прохождение каждым из участников промежуточного финиша, записывая его номер с использованием минимально возможного количества бит, одинакового для каждого спортсмена. Какой объём памяти будет использован устройством, когда промежуточный финиш прошли 90 велосипедистов? (Ответ дайте в битах.)", "answer": "630", "description": "Известно, что с помощью N бит можно закодировать 2^N различных чисел. Поскольку 2^6 < 96 < 2^7 и для каждого спортсмена число бит одинаково, то для записи каждого из 96 номеров необходимо 7 бит памяти. Поэтому сообщение о 90 номерах имеет объем 90 · 7 = 630 бит.\n"}, {"id": "2", "text": "При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 11 символов и содержащий только символы А, Б, В, Г, Д, Е. Каждый такой пароль в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт, при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит. Определите, сколько байт необходимо для хранения 20 паролей.", "answer": "100", "description": "Согласно условию, в пароле могут быть использованы 6 символов. Известно, что с помощью N бит можно закодировать 2^N различных вариантов. Поскольку 2^2 < 6 < 2^3, то для записи каждого из 6 символов необходимо 3 бита.\nДля хранения всех 11 символов пароля нужно 3 · 11 = 33 бита, а т. к. для записи используется целое число байт, то берём ближайшее не меньшее значение, кратное восьми, это число 40 = 5 · 8 бит = 5 байт.\nТогда для записи двадцати паролей необходимо 5 · 20 = 100 байт.\n"}, {"id": "3", "text": "При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 15 символов и содержащий только символы из 12-символьного набора: А, В, C, D, Е, F, G, H, K, L, M, N. В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт. При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит. Кроме собственно пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего выделено целое число байт; это число одно и то же для всех пользователей. Для хранения сведений о 20 пользователях потребовалось 400 байт. Сколько байт выделено для хранения дополнительных сведений об одном пользователе? В ответе запишите только целое число – количество байт.", "answer": "12", "description": "Согласно условию, в номере могут быть использованы 12 букв. Известно, что с помощью N бит можно закодировать 2^N различных вариантов. Поскольку 2^3 < 12 < 2^4, то для записи каждого из 12 символов необходимо 4 бита.\nДля хранения всех 15 символов пароля нужно 4 · 15 = 60 бит, а т. к. для записи используется целое число байт, то берём ближайшее не меньшее значение, кратное восьми, это число 64 = 8 · 8 бит (8 байт).\nПусть количество памяти, отведенное под дополнительные сведения равно x, тогда:\n20 * (8+x) = 400,\nx = 12.\n"}, {"id": "4", "text": "B некоторой стране автомобильный номер длиной 8 символов составляют из заглавных букв (задействовано 20 различных букв) и десятичных цифр в любом порядке. Каждый такой номер в компьютерной программе записывается минимально возможным и одинаковым целым количеством байтов (при этом используют посимвольное кодирование и вcе СИМВОЛЫ кодируются одинаковым и минимально возможным количеством битов). Определите объём памяти, отводимый этой программой для записи 40 номеров. (Ответ дайте в байтах.)", "answer": "200", "description": "Согласно условию, в номере могут быть использованы 10 цифр (0..9) и 20 букв, всего 10 + 20 = 30 символов. Известно, что с помощью N бит можно закодировать 2^N различных вариантов. Поскольку 2^4 < 30 < 2^5, то для записи каждого из 30 символов необходимо 5 бит. Для хранения всех 8 символов номера нужно 8 * 5 = 40 бит или 5 байт. Тогда 40 номеров занимают 5 * 40 = 200 байт."}]}